
. 
. version 13

. 
. set seed 0193284710

. 
. cmp setup
$cmp_out      = 0
$cmp_missing  = .
$cmp_cont     = 1
$cmp_left     = 2
$cmp_right    = 3
$cmp_probit   = 4
$cmp_oprobit  = 5
$cmp_mprobit  = 6
$cmp_int      = 7
$cmp_trunc    = 8  (deprecated)
$cmp_roprobit = 9
$cmp_frac     = 10

. 
. use laborsup, clear

. 
. cmp (kids = fem_inc male_educ), ind($cmp_cont) quietly

Fitting individual models as starting point for full model fit.

Fitting constants-only model for LR test of overall model fit.

Fitting full model.

Mixed-process regression                                Number of obs =    500
                                                        LR chi2(2)    =  24.10
Log likelihood = -851.94963                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
        kids | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
kids         |
     fem_inc |  -.0237664   .0048068    -4.94   0.000    -.0331877   -.0143452
   male_educ |  -.0365994   .0231308    -1.58   0.114    -.0819349    .0087361
       _cons |   2.844829   .3138795     9.06   0.000     2.229637    3.460022
-------------+----------------------------------------------------------------
    /lnsig_1 |   .2849607   .0316228     9.01   0.000     .2229812    .3469402
-------------+----------------------------------------------------------------
       sig_1 |    1.32971   .0420491                      1.249797    1.414732
------------------------------------------------------------------------------

. 
. cmp (kids = fem_inc male_educ) (fem_work = male_educ), ind($cmp_cont $cmp_cont) quietly

Fitting individual models as starting point for full model fit.

Fitting constant-only model for LR test of overall model fit.

Fitting full model.

Mixed-process regression                                Number of obs =    500
                                                        LR chi2(3)    =  43.82
Log likelihood = -1194.6747                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
kids         |
     fem_inc |  -.0172772   .0065563    -2.64   0.008    -.0301273    -.004427
   male_educ |  -.0296211   .0236617    -1.25   0.211    -.0759971     .016755
       _cons |   2.643677   .3433653     7.70   0.000     1.970693    3.316661
-------------+----------------------------------------------------------------
fem_work     |
   male_educ |  -.0486565   .0081597    -5.96   0.000    -.0646492   -.0326639
       _cons |   1.038224   .0999824    10.38   0.000     .8422623    1.234186
-------------+----------------------------------------------------------------
    /lnsig_1 |   .2867799   .0318349     9.01   0.000     .2243846    .3491753
    /lnsig_2 |  -.7313848   .0316228   -23.13   0.000    -.7933643   -.6694053
/atanhrho_12 |  -.0886333   .0610152    -1.45   0.146     -.208221    .0309543
-------------+----------------------------------------------------------------
       sig_1 |   1.332131   .0424083                      1.251552    1.417898
       sig_2 |   .4812421   .0152182                      .4523205     .512013
      rho_12 |   -.088402   .0605384                     -.2052631    .0309444
------------------------------------------------------------------------------

. 
. cmp (fem_educ = kids other_inc fem_inc) (male_educ = kids other_inc fem_inc), ind(1 1) qui

Fitting individual models as starting point for full model fit.

Fitting constant-only model for LR test of overall model fit.

Fitting full model.

Mixed-process regression                                Number of obs =    500
                                                        LR chi2(6)    = 141.07
Log likelihood = -2318.4783                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
fem_educ     |
        kids |   .1755926   .0845501     2.08   0.038     .0098775    .3413077
   other_inc |   .0260839   .0068414     3.81   0.000      .012675    .0394929
     fem_inc |   .0698476   .0100735     6.93   0.000     .0501039    .0895913
       _cons |   9.138883   .5099015    17.92   0.000     8.139494    10.13827
-------------+----------------------------------------------------------------
male_educ    |
        kids |    -.10911   .0806157    -1.35   0.176    -.2671139    .0488939
   other_inc |   .0547246   .0065231     8.39   0.000     .0419396    .0675096
     fem_inc |  -.0143312   .0096047    -1.49   0.136    -.0331562    .0044937
       _cons |   9.726957   .4861743    20.01   0.000     8.774073    10.67984
-------------+----------------------------------------------------------------
    /lnsig_1 |   .9235521   .0316228    29.21   0.000     .8615726    .9855316
    /lnsig_2 |   .8759017   .0316228    27.70   0.000     .8139222    .9378812
/atanhrho_12 |  -.0273615   .0447214    -0.61   0.541    -.1150137    .0602908
-------------+----------------------------------------------------------------
       sig_1 |   2.518219   .0796331                       2.36688    2.679236
       sig_2 |   2.401039   .0759275                      2.256742    2.554563
      rho_12 |  -.0273547   .0446879                     -.1145093    .0602178
------------------------------------------------------------------------------

. 
. cmp (kids = fem_inc male_educ) (fem_work = kids fem_inc), ind($cmp_cont $cmp_cont) qui

Fitting individual models as starting point for full model fit.

Fitting constant-only model for LR test of overall model fit.

Fitting full model.

Mixed-process regression                                Number of obs =    500
                                                        LR chi2(4)    = 356.31
Log likelihood = -1038.4289                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
kids         |
     fem_inc |  -.0237664   .0048065    -4.94   0.000    -.0331869   -.0143459
   male_educ |  -.0365988   .0230936    -1.58   0.113    -.0818614    .0086639
       _cons |   2.844821   .3134303     9.08   0.000     2.230509    3.459133
-------------+----------------------------------------------------------------
fem_work     |
        kids |   .5502696   .3948247     1.39   0.163    -.2235726    1.324112
     fem_inc |   .0395966   .0091928     4.31   0.000      .021579    .0576142
       _cons |  -1.349211   .9403718    -1.43   0.151    -3.192306    .4938844
-------------+----------------------------------------------------------------
    /lnsig_1 |   .2849607   .0316228     9.01   0.000      .222981    .3469403
    /lnsig_2 |   -.183551   .5726942    -0.32   0.749    -1.306011     .938909
/atanhrho_12 |  -1.507716   .6323635    -2.38   0.017    -2.747126   -.2683068
-------------+----------------------------------------------------------------
       sig_1 |    1.32971   .0420492                      1.249797    1.414732
       sig_2 |   .8323094   .4766588                      .2708985     2.55719
      rho_12 |   -.906533   .1126859                      -.991813   -.2620486
------------------------------------------------------------------------------

. 
. cmp (kids = fem_inc male_educ other_inc) (fem_work = kids), ind($cmp_cont $cmp_cont) qui

Fitting individual models as starting point for full model fit.

Fitting constant-only model for LR test of overall model fit.

Fitting full model.

Mixed-process regression                                Number of obs =    500
                                                        LR chi2(4)    = 356.77
Log likelihood = -1038.1999                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
kids         |
     fem_inc |  -.0187422   .0043993    -4.26   0.000    -.0273647   -.0101198
   male_educ |   .0096536   .0051052     1.89   0.059    -.0003524    .0196595
   other_inc |   .0017429   .0008288     2.10   0.035     .0001186    .0033672
       _cons |   2.113825   .0956265    22.11   0.000     1.926401    2.301249
-------------+----------------------------------------------------------------
fem_work     |
        kids |  -1.356057     .31391    -4.32   0.000     -1.97131    -.740805
       _cons |   3.135569   .6256257     5.01   0.000     1.909366    4.361773
-------------+----------------------------------------------------------------
    /lnsig_1 |   .2903146   .0316357     9.18   0.000     .2283097    .3523194
    /lnsig_2 |   .6009221     .22804     2.64   0.008      .153972    1.047872
/atanhrho_12 |   2.336562   .2344989     9.96   0.000     1.876952    2.796171
-------------+----------------------------------------------------------------
       sig_1 |   1.336848   .0422921                      1.256474    1.422363
       sig_2 |     1.8238   .4158993                      1.166458    2.851577
      rho_12 |   .9814869   .0086022                      .9542202    .9925751
------------------------------------------------------------------------------

. 
. cmp (kids = fem_inc male_educ), ind($cmp_probit) qui

Fitting individual models as starting point for full model fit.

Fitting constants-only model for LR test of overall model fit.

Fitting full model.

Mixed-process regression                                Number of obs =    500
                                                        LR chi2(2)    =  14.81
Log likelihood = -222.11678                             Prob > chi2   = 0.0006

------------------------------------------------------------------------------
        kids | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
kids         |
     fem_inc |  -.0189857   .0049976    -3.80   0.000    -.0287808   -.0091905
   male_educ |  -.0432639   .0263379    -1.64   0.100    -.0948853    .0083574
       _cons |   1.835102   .3638179     5.04   0.000     1.122032    2.548172
------------------------------------------------------------------------------

. predict p2, pr

. margins, dydx(*) predict(pr)

Average marginal effects                                   Number of obs = 500
Model VCE: OIM

Expression: Pr(kids), predict(pr)
dy/dx wrt:  fem_inc male_educ

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     fem_inc |  -.0046772   .0011955    -3.91   0.000    -.0070204    -.002334
   male_educ |  -.0106583   .0064587    -1.65   0.099    -.0233171    .0020006
------------------------------------------------------------------------------

. 
. cmp (kids = fem_inc male_educ), ind($cmp_oprobit) qui

Fitting individual models as starting point for full model fit.

Fitting constants-only model for LR test of overall model fit.

Fitting full model.

Mixed-process regression                                Number of obs =    500
                                                        LR chi2(2)    =  24.40
Log likelihood = -788.56366                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
        kids | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
kids         |
     fem_inc |  -.0190885   .0039024    -4.89   0.000    -.0267371   -.0114398
   male_educ |   -.029918   .0183699    -1.63   0.103    -.0659224    .0060864
-------------+----------------------------------------------------------------
    /cut_1_1 |  -1.676454    .257818    -6.50   0.000    -2.181768    -1.17114
    /cut_1_2 |  -.9404509   .2527617    -3.72   0.000    -1.435855   -.4450471
    /cut_1_3 |  -.3540122   .2512043    -1.41   0.159    -.8463636    .1383392
    /cut_1_4 |   .2067936   .2516179     0.82   0.411    -.2863685    .6999557
------------------------------------------------------------------------------

. margins, dydx(*) predict(eq(#1) outcome(#2) pr)

Average marginal effects                                   Number of obs = 500
Model VCE: OIM

Expression: Pr(kids=1), predict(eq(#1) outcome(#2) pr)
dy/dx wrt:  fem_inc male_educ

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     fem_inc |   .0025021   .0005424     4.61   0.000     .0014391    .0035652
   male_educ |   .0039217   .0024177     1.62   0.105    -.0008169    .0086603
------------------------------------------------------------------------------

. 
. gen byte anykids = kids > 0

. cmp (anykids = fem_inc male_educ) (fem_work = male_educ), ind($cmp_probit $cmp_probit)

Fitting individual models as starting point for full model fit.
Note: For programming reasons, these initial estimates may deviate from your specification.
      For exact fits of each equation alone, run cmp separately on each.

Iteration 0:   log likelihood = -229.52167  
Iteration 1:   log likelihood = -222.14481  
Iteration 2:   log likelihood = -222.11678  
Iteration 3:   log likelihood = -222.11678  

Probit regression                                       Number of obs =    500
                                                        LR chi2(2)    =  14.81
                                                        Prob > chi2   = 0.0006
Log likelihood = -222.11678                             Pseudo R2     = 0.0323

------------------------------------------------------------------------------
     anykids | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     fem_inc |  -.0189857   .0049976    -3.80   0.000    -.0287808   -.0091905
   male_educ |  -.0432639   .0263379    -1.64   0.100    -.0948853    .0083574
       _cons |   1.835102   .3638179     5.04   0.000     1.122032    2.548172
------------------------------------------------------------------------------

Iteration 0:   log likelihood = -344.63508  
Iteration 1:   log likelihood = -327.72272  
Iteration 2:   log likelihood =  -327.7042  
Iteration 3:   log likelihood =  -327.7042  

Probit regression                                       Number of obs =    500
                                                        LR chi2(1)    =  33.86
                                                        Prob > chi2   = 0.0000
Log likelihood = -327.7042                              Pseudo R2     = 0.0491

------------------------------------------------------------------------------
    fem_work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   male_educ |  -.1267233    .022085    -5.74   0.000    -.1700091   -.0834375
       _cons |   1.400186   .2690126     5.20   0.000     .8729312    1.927441
------------------------------------------------------------------------------

Fitting constant-only model for LR test of overall model fit.

Fitting full model.

Iteration 0:   log likelihood =  -549.7811  
Iteration 1:   log likelihood = -549.72147  
Iteration 2:   log likelihood = -549.72146  

Mixed-process regression                                Number of obs =    500
                                                        LR chi2(3)    =  42.31
Log likelihood = -549.72146                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
anykids      |
     fem_inc |  -.0169214   .0068244    -2.48   0.013     -.030297   -.0035458
   male_educ |  -.0408605   .0268713    -1.52   0.128    -.0935274    .0118063
       _cons |   1.769185   .3932758     4.50   0.000     .9983783    2.539991
-------------+----------------------------------------------------------------
fem_work     |
   male_educ |  -.1266464   .0220798    -5.74   0.000     -.169922   -.0833709
       _cons |   1.399397   .2689705     5.20   0.000     .8722249     1.92657
-------------+----------------------------------------------------------------
/atanhrho_12 |  -.0525521   .1177135    -0.45   0.655    -.2832664    .1781621
-------------+----------------------------------------------------------------
      rho_12 |  -.0525038    .117389                     -.2759255    .1763007
------------------------------------------------------------------------------

. preserve

. replace anykids=1
(86 real changes made)

. replace fem_work=1
(272 real changes made)

. margins, dydx(fem_inc) expression(exp(predict(lnl))) force // marginal effect on probability of (1,1)
note: expression is a function of possibly stochastic quantities other than e(b).

Average marginal effects                                   Number of obs = 500
Model VCE: OIM

Expression: exp(predict(lnl))
dy/dx wrt:  fem_inc

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     fem_inc |  -.0019524   .0006673    -2.93   0.003    -.0032603   -.0006446
------------------------------------------------------------------------------

. restore

. 
. cmp (anykids = ) (fem_work = ), ind($cmp_probit $cmp_probit) nolr qui

Fitting individual models as starting point for full model fit.

Fitting full model.

Mixed-process regression                                   Number of obs = 500
                                                           Wald chi2(0)  =   .
Log likelihood = -570.87444                                Prob > chi2   =   .

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
anykids      |
       _cons |   .9462914   .0661961    14.30   0.000     .8165493    1.076033
-------------+----------------------------------------------------------------
fem_work     |
       _cons |  -.1105162   .0561745    -1.97   0.049    -.2206161   -.0004163
-------------+----------------------------------------------------------------
/atanhrho_12 |  -.2140342   .0842014    -2.54   0.011     -.379066   -.0490024
-------------+----------------------------------------------------------------
      rho_12 |  -.2108247   .0804589                     -.3618961   -.0489633
------------------------------------------------------------------------------

. 
. cmp (fem_work = other_inc fem_educ kids) (other_inc = fem_educ kids male_educ), ind($cmp_probit $cmp_cont)

Fitting individual models as starting point for full model fit.
Note: For programming reasons, these initial estimates may deviate from your specification.
      For exact fits of each equation alone, run cmp separately on each.

Iteration 0:   log likelihood = -344.63508  
Iteration 1:   log likelihood = -255.36855  
Iteration 2:   log likelihood = -255.31444  
Iteration 3:   log likelihood = -255.31444  

Probit regression                                       Number of obs =    500
                                                        LR chi2(3)    = 178.64
                                                        Prob > chi2   = 0.0000
Log likelihood = -255.31444                             Pseudo R2     = 0.2592

------------------------------------------------------------------------------
    fem_work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   other_inc |  -.0382429    .004075    -9.38   0.000    -.0462297   -.0302561
    fem_educ |   .2175954   .0266075     8.18   0.000     .1654458    .2697451
        kids |  -.2056541   .0473541    -4.34   0.000    -.2984665   -.1128417
       _cons |   -.465968   .3393511    -1.37   0.170    -1.131084    .1991479
------------------------------------------------------------------------------

Warning: regressor matrix for fem_work equation appears ill-conditioned. (Condition number = 33.685202.)
This might prevent convergence. If it does, and if you have not done so already, you may need to remove nearly
collinear regressors to achieve convergence. Or you may need to add a nrtolerance(#) or nonrtolerance option to the command line.
See cmp tips.

      Source |       SS           df       MS      Number of obs   =       500
-------------+----------------------------------   F(3, 496)       =     34.36
       Model |  28864.2732         3  9621.42439   Prob > F        =    0.0000
    Residual |  138881.269       496  280.002558   R-squared       =    0.1721
-------------+----------------------------------   Adj R-squared   =    0.1671
       Total |  167745.542       499  336.163411   Root MSE        =    16.733

------------------------------------------------------------------------------
   other_inc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    fem_educ |   .3351866   .2837344     1.18   0.238    -.2222829    .8926562
        kids |   .8329056   .5497701     1.52   0.130    -.2472597    1.913071
   male_educ |   2.845253   .2838838    10.02   0.000      2.28749    3.403016
       _cons |   9.872562   5.049432     1.96   0.051    -.0483506    19.79347
------------------------------------------------------------------------------

Warning: regressor matrix for other_inc equation appears ill-conditioned. (Condition number = 57.364672.)
This might prevent convergence. If it does, and if you have not done so already, you may need to remove nearly
collinear regressors to achieve convergence. Or you may need to add a nrtolerance(#) or nonrtolerance option to the command line.
See cmp tips.

Fitting constant-only model for LR test of overall model fit.

Fitting full model.

Iteration 0:   log likelihood =  -2370.935  
Iteration 1:   log likelihood = -2369.6061  
Iteration 2:   log likelihood = -2368.2515  
Iteration 3:   log likelihood = -2368.2064  
Iteration 4:   log likelihood = -2368.2062  

Mixed-process regression                                Number of obs =    500
                                                        LR chi2(6)    = 191.16
Log likelihood = -2368.2062                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
fem_work     |
   other_inc |  -.0542757   .0060854    -8.92   0.000    -.0662028   -.0423486
    fem_educ |   .2111108   .0268648     7.86   0.000     .1584567    .2637648
        kids |  -.1820925   .0478267    -3.81   0.000    -.2758312   -.0883539
       _cons |   .3672154    .448072     0.82   0.412    -.5109895     1.24542
-------------+----------------------------------------------------------------
other_inc    |
    fem_educ |   .3351866   .2825972     1.19   0.236    -.2186938     .889067
        kids |   .8329056   .5475666     1.52   0.128    -.2403051    1.906116
   male_educ |   2.845252   .2827462    10.06   0.000      2.29108    3.399424
       _cons |   9.872573   5.029195     1.96   0.050     .0155327    19.72961
-------------+----------------------------------------------------------------
    /lnsig_2 |   2.813383   .0316228    88.97   0.000     2.751404    2.875363
/atanhrho_12 |   .3907892   .1509444     2.59   0.010     .0949436    .6866348
-------------+----------------------------------------------------------------
       sig_2 |   16.66621   .5270318                      15.66461    17.73186
      rho_12 |   .3720404   .1300516                      .0946593    .5958158
------------------------------------------------------------------------------

. margins, predict(pr) dydx(*) force
note: prediction is a function of possibly stochastic quantities other than e(b).

Average marginal effects                                   Number of obs = 500
Model VCE: OIM

Expression: Pr(fem_work), predict(pr)
dy/dx wrt:  other_inc fem_educ kids male_educ

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   other_inc |   -.014015   .0009836   -14.25   0.000    -.0159428   -.0120872
    fem_educ |   .0545128   .0066007     8.26   0.000     .0415757    .0674499
        kids |  -.0470198   .0123396    -3.81   0.000     -.071205   -.0228345
   male_educ |          0  (omitted)
------------------------------------------------------------------------------

. 
. cmp (other_inc = fem_educ kids fem_work) (fem_work = male_educ), ind($cmp_cont $cmp_probit) qui

Fitting individual models as starting point for full model fit.

Fitting constant-only model for LR test of overall model fit.

Fitting full model.

Mixed-process regression                                Number of obs =    500
                                                        LR chi2(4)    =  93.37
Log likelihood = -2417.1007                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
other_inc    |
    fem_educ |   1.191099   .2863871     4.16   0.000     .6297904    1.752407
        kids |  -.2447521   .5381903    -0.45   0.649    -1.299586    .8100815
    fem_work |  -37.75183   3.097728   -12.19   0.000    -43.82327   -31.68039
       _cons |   52.95283   3.754117    14.11   0.000     45.59489    60.31076
-------------+----------------------------------------------------------------
fem_work     |
   male_educ |  -.1551379     .01907    -8.14   0.000    -.1925144   -.1177614
       _cons |   1.764643   .2349592     7.51   0.000     1.304132    2.225155
-------------+----------------------------------------------------------------
    /lnsig_1 |    2.96751   .0526832    56.33   0.000     2.864253    3.070767
/atanhrho_12 |   .9224885   .1309029     7.05   0.000     .6659235    1.179054
-------------+----------------------------------------------------------------
       sig_1 |   19.44345   1.024342                      17.53595    21.55843
      rho_12 |   .7270725   .0617031                       .582292    .8271529
------------------------------------------------------------------------------

. 
. cmp (fem_inc = kids male_educ), ind("cond(fem_inc>10, $cmp_cont, $cmp_left)") qui

Fitting individual models as starting point for full model fit.

Fitting constants-only model for LR test of overall model fit.

Fitting full model.

Mixed-process regression                                Number of obs =    500
                                                        LR chi2(2)    =  59.33
Log likelihood = -1188.5826                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
     fem_inc | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
fem_inc      |
        kids |  -4.135794   .8287292    -4.99   0.000    -5.760073   -2.511514
   male_educ |   -2.55304   .4308618    -5.93   0.000    -3.397513   -1.708566
       _cons |    46.1764   5.368432     8.60   0.000     35.65447    56.69834
-------------+----------------------------------------------------------------
    /lnsig_1 |   3.075804   .0521458    58.98   0.000       2.9736    3.178008
-------------+----------------------------------------------------------------
       sig_1 |    21.6673   1.129859                      19.56222     23.9989
------------------------------------------------------------------------------

. margins, dydx(*) predict(pr(17 .))

Average marginal effects                                   Number of obs = 500
Model VCE: OIM

Expression: predict(pr(17 .))
dy/dx wrt:  kids male_educ

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        kids |  -.0649911   .0122597    -5.30   0.000    -.0890197   -.0409625
   male_educ |  -.0401192   .0061783    -6.49   0.000    -.0522286   -.0280099
------------------------------------------------------------------------------

. 
. cmp (fem_inc=kids male_educ) (male_educ=kids other_inc fem_work), ind("cond(fem_inc>10,$cmp_cont,$cmp_left)" $cmp_cont)

Fitting individual models as starting point for full model fit.
Note: For programming reasons, these initial estimates may deviate from your specification.
      For exact fits of each equation alone, run cmp separately on each.

Tobit regression                                    Number of obs     =    500
                                                           Uncensored =    227
Limits: Lower =    10                                   Left-censored =    272
        Upper = 84.61                                  Right-censored =      1

                                                    LR chi2(2)        =  59.41
                                                    Prob > chi2       = 0.0000
Log likelihood = -1186.6643                         Pseudo R2         = 0.0244

------------------------------------------------------------------------------
     fem_inc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        kids |  -4.155063   .8331107    -4.99   0.000    -5.791908   -2.518218
   male_educ |  -2.569653   .4333412    -5.93   0.000    -3.421055   -1.718251
       _cons |   46.36452   5.398424     8.59   0.000     35.75802    56.97101
-------------+----------------------------------------------------------------
      /sigma |   21.77316   1.139868                      19.53362     24.0127
------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =       500
-------------+----------------------------------   F(3, 496)       =     36.31
       Model |  626.399492         3  208.799831   Prob > F        =    0.0000
    Residual |  2852.02251       496  5.75004538   R-squared       =    0.1801
-------------+----------------------------------   Adj R-squared   =    0.1751
       Total |    3478.422       499  6.97078557   Root MSE        =    2.3979

------------------------------------------------------------------------------
   male_educ | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        kids |  -.1230899   .0800727    -1.54   0.125    -.2804134    .0342336
   other_inc |   .0519343   .0063989     8.12   0.000      .039362    .0645066
    fem_work |   -.655726   .2389342    -2.74   0.006    -1.125174    -.186278
       _cons |   9.932175   .4300121    23.10   0.000     9.087305    10.77704
------------------------------------------------------------------------------

Fitting constant-only model for LR test of overall model fit.

Fitting full model.

Iteration 0:   log likelihood = -2324.1055  (not concave)
Iteration 1:   log likelihood = -2294.9222  (not concave)
Iteration 2:   log likelihood = -2269.2158  
Iteration 3:   log likelihood =  -2202.286  
Iteration 4:   log likelihood = -2161.7932  
Iteration 5:   log likelihood = -2103.8001  
Iteration 6:   log likelihood = -2075.5742  
Iteration 7:   log likelihood =   -2069.05  
Iteration 8:   log likelihood = -2067.1253  
Iteration 9:   log likelihood = -2066.2166  
Iteration 10:  log likelihood = -2066.0937  
Iteration 11:  log likelihood = -2065.9115  
Iteration 12:  log likelihood = -2065.9114  

Mixed-process regression                                Number of obs =    500
                                                        LR chi2(5)    = 659.40
Log likelihood = -2065.9114                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
fem_inc      |
        kids |  -6.207803   2.710826    -2.29   0.022    -11.52093   -.8946812
   male_educ |  -31.55619   5.641424    -5.59   0.000    -42.61318    -20.4992
       _cons |   387.5881   66.67215     5.81   0.000     256.9131    518.2632
-------------+----------------------------------------------------------------
male_educ    |
        kids |   -.153239   .0830846    -1.84   0.065    -.3160819    .0096038
   other_inc |   .0104804   .0024889     4.21   0.000     .0056023    .0153585
    fem_work |  -1.570062   .2026156    -7.75   0.000    -1.967181   -1.172943
       _cons |   12.46489   .2254686    55.28   0.000     12.02298     12.9068
-------------+----------------------------------------------------------------
    /lnsig_1 |   4.376393   .1787264    24.49   0.000     4.026096    4.726691
    /lnsig_2 |   .9128785   .0318152    28.69   0.000     .8505219    .9752351
/atanhrho_12 |    2.55077   .1790992    14.24   0.000     2.199742    2.901798
-------------+----------------------------------------------------------------
       sig_1 |    79.5506   14.21779                       56.0417    112.9212
       sig_2 |   2.491484    .079267                      2.340868    2.651791
      rho_12 |   .9878989   .0043084                      .9757307    .9939848
------------------------------------------------------------------------------

. 
. use intregxmpl, clear
(Wages of women)

. cmp (wage1 wage2 = age age2 nev_mar rural school tenure), ind($cmp_int) qui

Fitting individual models as starting point for full model fit.

Fitting constants-only model for LR test of overall model fit.

Fitting full model.

Mixed-process regression                                Number of obs =    488
                                                        LR chi2(6)    = 221.61
Log likelihood = -856.33293                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
wage1        |
         age |   .7914438   .4433604     1.79   0.074    -.0775265    1.660414
        age2 |  -.0132624   .0073028    -1.82   0.069    -.0275757    .0010509
     nev_mar |  -.2075022   .8119581    -0.26   0.798    -1.798911    1.383906
       rural |  -3.043044   .7757324    -3.92   0.000    -4.563452   -1.522637
      school |   1.334721   .1357873     9.83   0.000     1.068583    1.600859
      tenure |   .8000664   .1045077     7.66   0.000     .5952351    1.004898
       _cons |  -12.70238   6.367117    -1.99   0.046     -25.1817   -.2230584
-------------+----------------------------------------------------------------
    /lnsig_1 |   1.987823   .0346543    57.36   0.000     1.919902    2.055744
-------------+----------------------------------------------------------------
       sig_1 |   7.299626   .2529633                       6.82029     7.81265
------------------------------------------------------------------------------

. 
. use laborsub, clear

. cmp (whrs = kl6 k618 wa we, trunc(0 .)), ind($cmp_cont) qui

Fitting individual models as starting point for full model fit.

Fitting constants-only model for LR test of overall model fit.

Fitting full model.

Mixed-process regression                                Number of obs =    150
                                                        LR chi2(4)    =  12.43
Log likelihood = -1200.9157                             Prob > chi2   = 0.0144

------------------------------------------------------------------------------
        whrs | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
whrs         |
         kl6 |  -803.0036    321.361    -2.50   0.012     -1432.86   -173.1476
        k618 |  -172.8749   88.72889    -1.95   0.051    -346.7803      1.0305
          wa |  -8.821117   14.36847    -0.61   0.539     -36.9828    19.34057
          we |   16.52872   46.50371     0.36   0.722    -74.61688    107.6743
       _cons |    1586.26   912.3541     1.74   0.082    -201.9213    3374.441
-------------+----------------------------------------------------------------
    /lnsig_1 |   6.891347   .0960051    71.78   0.000      6.70318    7.079514
-------------+----------------------------------------------------------------
       sig_1 |   983.7256   94.44272                      814.9937    1187.391
------------------------------------------------------------------------------

. 
. use 401k, clear

. cmp (prate = mrate ltotemp age i.sole), ind($cmp_frac) qui

Note: fractional probit models imply vce(robust).

Fitting individual models as starting point for full model fit.

Fitting full model.

Mixed-process regression                                Number of obs =  4,075
                                                        Wald chi2(4)  = 695.89
Log pseudolikelihood = -1681.9607                       Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             |               Robust
       prate | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
prate        |
       mrate |   .5955725    .038756    15.37   0.000     .5196122    .6715328
     ltotemp |  -.1172851   .0080003   -14.66   0.000    -.1329655   -.1016048
         age |   .0180259   .0014218    12.68   0.000     .0152392    .0208126
             |
        sole |
  only plan  |   .0944158   .0271696     3.48   0.001     .0411645    .1476672
       _cons |   1.428854   .0593694    24.07   0.000     1.312493    1.545216
------------------------------------------------------------------------------

. margins, dydx(mrate) predict(pr)

Average marginal effects                                 Number of obs = 4,075
Model VCE: Robust

Expression: Pr(prate), predict(pr)
dy/dx wrt:  mrate

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       mrate |   .1362769   .0088064    15.47   0.000     .1190166    .1535372
------------------------------------------------------------------------------

. 
. use sysdsn3, clear
(Health insurance data)

. cmp (insure = age male nonwhite site2 site3, iia), nolr ind($cmp_mprobit) qui

Fitting individual models as starting point for full model fit.

Fitting full model.

Mixed-process regression                                Number of obs =    615
                                                        Wald chi2(10) =  40.18
Log likelihood = -534.52833                             Prob > chi2   = 0.0000

 ( 1)  [Indemnity]_cons = 0
------------------------------------------------------------------------------
      insure | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
Indemnity    |
       _cons |          0  (omitted)
-------------+----------------------------------------------------------------
Prepaid      |
         age |  -.0098536   .0052688    -1.87   0.061    -.0201802     .000473
        male |   .4774678   .1718316     2.78   0.005     .1406841    .8142515
    nonwhite |   .8245003   .1977582     4.17   0.000     .4369013    1.212099
       site2 |   .0973956   .1794546     0.54   0.587    -.2543289    .4491201
       site3 |   -.495892   .1904984    -2.60   0.009     -.869262   -.1225221
       _cons |     .22315   .2792424     0.80   0.424     -.324155    .7704549
-------------+----------------------------------------------------------------
Uninsure     |
         age |  -.0050814   .0075327    -0.67   0.500    -.0198452    .0096823
        male |   .3332637   .2432987     1.37   0.171    -.1435929    .8101203
    nonwhite |   .2485859   .2767734     0.90   0.369      -.29388    .7910518
       site2 |  -.6899493   .2804498    -2.46   0.014    -1.239621   -.1402778
       site3 |  -.1788447   .2479898    -0.72   0.471    -.6648957    .3072063
       _cons |  -.9855918   .3891874    -2.53   0.011    -1.748385   -.2227986
------------------------------------------------------------------------------

. margins, dydx(nonwhite) predict(eq(#2) pr)

Average marginal effects                                   Number of obs = 615
Model VCE: OIM

Expression: predict(eq(#2) pr)
dy/dx wrt:  nonwhite

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    nonwhite |   .2203455   .0499824     4.41   0.000     .1223818    .3183092
------------------------------------------------------------------------------

. 
. use travel, clear

. drop invehiclecost traveltime partysize

. reshape wide choice termtime travelcost, i(id) j(mode)
(j = 1 2 3 4)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations              840   ->   210         
Number of variables                   6   ->   14          
j variable (4 values)              mode   ->   (dropped)
xij variables:
                                 choice   ->   choice1 choice2 ... choice4
                               termtime   ->   termtime1 termtime2 ... termtime4
                             travelcost   ->   travelcost1 travelcost2 ... travelcost4
-----------------------------------------------------------------------------

. constraint 1 [air]termtime1 = [train]termtime2

. constraint 2 [train]termtime2 = [bus]termtime3

. constraint 3 [bus]termtime3 = [car]termtime4

. constraint 4 [air]travelcost1 = [train]travelcost2

. constraint 5 [train]travelcost2 = [bus]travelcost3

. constraint 6 [bus]travelcost3 = [car]travelcost4

. cmp (air:choice1=t*1) (train: choice2=income t*2) (bus: choice3=income t*3) (car: choice4=income t*4), ind((6 6 6 6)) constr(1/6) nodrop struct tech(dfp) ghkd(200)
Note: 200 is not prime. Prime draw counts are more reliable.


Fitting individual models as starting point for full model fit.
Note: For programming reasons, these initial estimates may deviate from your specification.
      For exact fits of each equation alone, run cmp separately on each.

Iteration 0:   log likelihood = -145.56091  
Iteration 1:   log likelihood = -89.521965  
Iteration 2:   log likelihood = -89.138921  
Iteration 3:   log likelihood = -89.138524  
Iteration 4:   log likelihood = -89.138524  

Probit regression                                       Number of obs =    210
                                                        Wald chi2(2)  =  87.01
Log likelihood = -89.138524                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
     choice1 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   termtime1 |  -.0397394   .0049624    -8.01   0.000    -.0494655   -.0300134
 travelcost1 |    .016428   .0027707     5.93   0.000     .0109975    .0218586
------------------------------------------------------------------------------

Warning: regressor matrix for choice1 equation appears ill-conditioned. (Condition number = 26.658455.)
This might prevent convergence. If it does, and if you have not done so already, you may need to remove nearly
collinear regressors to achieve convergence. Or you may need to add a nrtolerance(#) or nonrtolerance option to the command line.
See cmp tips.

Iteration 0:   log likelihood =  -128.2815  
Iteration 1:   log likelihood = -99.654741  
Iteration 2:   log likelihood = -99.360435  
Iteration 3:   log likelihood = -99.359774  
Iteration 4:   log likelihood = -99.359774  

Probit regression                                       Number of obs =    210
                                                        LR chi2(3)    =  57.84
                                                        Prob > chi2   = 0.0000
Log likelihood = -99.359774                             Pseudo R2     = 0.2255

------------------------------------------------------------------------------
     choice2 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      income |  -.0273942   .0057295    -4.78   0.000    -.0386238   -.0161647
   termtime2 |   -.031246   .0078369    -3.99   0.000    -.0466061   -.0158859
 travelcost2 |  -.0029287   .0019411    -1.51   0.131    -.0067332    .0008757
       _cons |   1.800957    .365807     4.92   0.000     1.083988    2.517925
------------------------------------------------------------------------------

Warning: regressor matrix for choice2 equation appears ill-conditioned. (Condition number = 29.529802.)
This might prevent convergence. If it does, and if you have not done so already, you may need to remove nearly
collinear regressors to achieve convergence. Or you may need to add a nrtolerance(#) or nonrtolerance option to the command line.
See cmp tips.

Iteration 0:   log likelihood = -86.124427  
Iteration 1:   log likelihood = -56.185551  
Iteration 2:   log likelihood = -55.564291  
Iteration 3:   log likelihood = -55.561526  
Iteration 4:   log likelihood = -55.561526  

Probit regression                                       Number of obs =    210
                                                        LR chi2(3)    =  61.13
                                                        Prob > chi2   = 0.0000
Log likelihood = -55.561526                             Pseudo R2     = 0.3549

------------------------------------------------------------------------------
     choice3 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      income |  -.0014197   .0070947    -0.20   0.841    -.0153251    .0124858
   termtime3 |  -.0802714   .0129349    -6.21   0.000    -.1056233   -.0549195
 travelcost3 |   .0034308   .0032244     1.06   0.287     -.002889    .0097505
       _cons |   1.574106   .5439714     2.89   0.004     .5079412     2.64027
------------------------------------------------------------------------------

Warning: regressor matrix for choice3 equation appears ill-conditioned. (Condition number = 37.647786.)
This might prevent convergence. If it does, and if you have not done so already, you may need to remove nearly
collinear regressors to achieve convergence. Or you may need to add a nrtolerance(#) or nonrtolerance option to the command line.
See cmp tips.

note: termtime4 omitted because of collinearity.
Iteration 0:   log likelihood = -124.70862  
Iteration 1:   log likelihood = -117.48714  
Iteration 2:   log likelihood = -117.45123  
Iteration 3:   log likelihood = -117.45123  

Probit regression                                       Number of obs =    210
                                                        LR chi2(2)    =  14.51
                                                        Prob > chi2   = 0.0007
Log likelihood = -117.45123                             Pseudo R2     = 0.0582

------------------------------------------------------------------------------
     choice4 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      income |    .017514   .0049475     3.54   0.000     .0078172    .0272109
   termtime4 |          0  (omitted)
 travelcost4 |   -.002538   .0020137    -1.26   0.208    -.0064847    .0014088
       _cons |  -.9812412   .2764572    -3.55   0.000    -1.523087   -.4393952
------------------------------------------------------------------------------
Parameters with singular variance will be retained in full model.

Fitting full model.
Likelihoods for 210 observations involve cumulative normal distributions above dimension 2.
Using ghk2() to simulate them. Settings:
    Sequence type = halton
    Number of draws per observation = 200
    Include antithetic draws = no
    Scramble = no
    Prime bases = 2 3
Each observation gets different draws, so changing the order of observations in the data set would change the results.


Iteration 0:   log likelihood = -377.95432  
Iteration 1:   log likelihood = -252.83656  (backed up)
Iteration 2:   log likelihood = -250.88465  (backed up)
Iteration 3:   log likelihood =  -248.0956  (backed up)
Iteration 4:   log likelihood = -243.91524  (backed up)
Iteration 5:   log likelihood = -243.86367  (backed up)
Iteration 6:   log likelihood = -221.52072  
Iteration 7:   log likelihood = -218.46659  
Iteration 8:   log likelihood = -218.16874  
Iteration 9:   log likelihood = -212.92306  
Iteration 10:  log likelihood = -207.82677  
Iteration 11:  log likelihood = -205.35613  
Iteration 12:  log likelihood = -201.52726  
Iteration 13:  log likelihood = -200.12044  
Iteration 14:  log likelihood = -195.76499  
Iteration 15:  log likelihood = -193.19278  
Iteration 16:  log likelihood = -191.47315  
Iteration 17:  log likelihood = -190.59554  
Iteration 18:  log likelihood = -190.32546  
Iteration 19:  log likelihood = -190.30033  
Iteration 20:  log likelihood = -190.17381  
Iteration 21:  log likelihood = -190.14855  
Iteration 22:  log likelihood =  -190.1413  
Iteration 23:  log likelihood = -190.13318  
Iteration 24:  log likelihood = -190.12611  
Iteration 25:  log likelihood = -190.12088  
Iteration 26:  log likelihood = -190.11598  
Iteration 27:  log likelihood = -190.11354  
Iteration 28:  log likelihood = -190.11316  
Iteration 29:  log likelihood = -190.11312  
Iteration 30:  log likelihood = -190.11311  

Mixed-process regression                                Number of obs =    210
                                                        Wald chi2(5)  =  32.43
Log likelihood = -190.11311                             Prob > chi2   = 0.0000

 ( 1)  [air]termtime1 - [train]termtime2 = 0
 ( 2)  [train]termtime2 - [bus]termtime3 = 0
 ( 3)  [bus]termtime3 - [car]termtime4 = 0
 ( 4)  [air]travelcost1 - [train]travelcost2 = 0
 ( 5)  [train]travelcost2 - [bus]travelcost3 = 0
 ( 6)  [bus]travelcost3 - [car]travelcost4 = 0
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
air          |
   termtime1 |  -.0378668   .0094329    -4.01   0.000     -.056355   -.0193787
 travelcost1 |  -.0097852   .0027786    -3.52   0.000    -.0152312   -.0043392
-------------+----------------------------------------------------------------
train        |
      income |  -.0292647   .0089728    -3.26   0.001    -.0468512   -.0116783
   termtime2 |  -.0378668   .0094329    -4.01   0.000     -.056355   -.0193787
 travelcost2 |  -.0097852   .0027786    -3.52   0.000    -.0152312   -.0043392
       _cons |   .5602284   .3964603     1.41   0.158    -.2168195    1.337276
-------------+----------------------------------------------------------------
bus          |
      income |  -.0127173    .007956    -1.60   0.110    -.0283108    .0028763
   termtime3 |  -.0378668   .0094329    -4.01   0.000     -.056355   -.0193787
 travelcost3 |  -.0097852   .0027786    -3.52   0.000    -.0152312   -.0043392
       _cons |  -.0620452   .4822132    -0.13   0.898    -1.007166    .8830753
-------------+----------------------------------------------------------------
car          |
      income |  -.0048188   .0077949    -0.62   0.536    -.0200965     .010459
   termtime4 |  -.0378668   .0094329    -4.01   0.000     -.056355   -.0193787
 travelcost4 |  -.0097852   .0027786    -3.52   0.000    -.0152312   -.0043392
       _cons |  -1.847739    .822487    -2.25   0.025    -3.459784   -.2356944
-------------+----------------------------------------------------------------
    /lnsig_3 |  -.2364396   .4846812    -0.49   0.626    -1.186397    .7135181
    /lnsig_4 |  -.3189652   .6312404    -0.51   0.613    -1.556174    .9182433
/atanhrho_23 |   1.006924   .3869184     2.60   0.009     .2485774     1.76527
/atanhrho_24 |   .5719993   .3973497     1.44   0.150    -.2067917     1.35079
/atanhrho_34 |   .8936937   .5514693     1.62   0.105    -.1871664    1.974554
-------------+----------------------------------------------------------------
       sig_3 |   .7894336   .3826236                      .3053193     2.04116
       sig_4 |   .7269009   .4588492                      .2109417    2.504886
      rho_23 |   .7644866   .1607879                      .2435809    .9430887
      rho_24 |   .5168261   .2912139                     -.2038936    .8742397
      rho_34 |   .7132133   .2709517                      -.185011     .962185
------------------------------------------------------------------------------

. predict cmppr1, eq(air) pr

. predict cmppr2, eq(train) pr

. predict cmppr3, eq(bus) pr

. predict cmppr4, eq(car) pr

. 
. use wlsrank, clear
(1992 Wisconsin Longitudinal Study data on job values)

. reshape wide rank high low, i(id) j(jobchar)
(j = 1 2 3 4)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations           12,904   ->   3,226       
Number of variables                   8   ->   16          
j variable (4 values)           jobchar   ->   (dropped)
xij variables:
                                   rank   ->   rank1 rank2 ... rank4
                                   high   ->   high1 high2 ... high4
                                    low   ->   low1 low2 ... low4
-----------------------------------------------------------------------------

. constraint 1 [esteem]high1=[variety]high2

. constraint 2 [esteem]high1=[autonomy]high3

. constraint 3 [esteem]high1=[security]high4

. constraint 4 [esteem]low1=[variety]low2

. constraint 5 [esteem]low1=[autonomy]low3

. constraint 6 [esteem]low1=[security]low4

. cmp (esteem:rank1=high1 low1)(variety:rank2=female score high2 low2)(autonomy:rank3=female score high3 ///
>   low3)(security:rank4=female score high4 low4),ind((9 9 9 9)) tech(dfp) ghkd(200, type(hammersley)) rev constr(1/6)
Note: 200 is not prime. Prime draw counts are more reliable.


Fitting individual models as starting point for full model fit.
Note: For programming reasons, these initial estimates may deviate from your specification.
      For exact fits of each equation alone, run cmp separately on each.

      Source |       SS           df       MS      Number of obs   =     3,226
-------------+----------------------------------   F(2, 3224)      =   1123.14
       Model |  12641.7869         2  6320.89344   Prob > F        =    0.0000
    Residual |  18144.2131     3,224  5.62785766   R-squared       =    0.4106
-------------+----------------------------------   Adj R-squared   =    0.4103
       Total |       30786     3,226  9.54308741   Root MSE        =    2.3723

------------------------------------------------------------------------------
       rank1 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       high1 |   2.740167   .0819013    33.46   0.000     2.579583    2.900751
        low1 |   3.014327   .0897933    33.57   0.000     2.838269    3.190384
------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =     3,226
-------------+----------------------------------   F(4, 3221)      =     22.17
       Model |  68.6874994         4  17.1718748   Prob > F        =    0.0000
    Residual |  2494.66433     3,221  .774499947   R-squared       =    0.0268
-------------+----------------------------------   Adj R-squared   =    0.0256
       Total |  2563.35183     3,225  .794837776   Root MSE        =    .88006

------------------------------------------------------------------------------
       rank2 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      female |   .0192768   .0310695     0.62   0.535    -.0416412    .0801948
       score |  -.0408149   .0161852    -2.52   0.012    -.0725492   -.0090806
       high2 |  -.1562345   .0454696    -3.44   0.001    -.2453868   -.0670821
        low2 |   .2398906   .0371174     6.46   0.000     .1671145    .3126667
       _cons |   1.575846   .0257235    61.26   0.000      1.52541    1.626282
------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =     3,226
-------------+----------------------------------   F(4, 3221)      =      9.06
       Model |  39.6433357         4  9.91083392   Prob > F        =    0.0000
    Residual |  3523.16634     3,221  1.09381134   R-squared       =    0.0111
-------------+----------------------------------   Adj R-squared   =    0.0099
       Total |  3562.80967     3,225  1.10474718   Root MSE        =    1.0459

------------------------------------------------------------------------------
       rank3 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      female |   .0213184   .0368782     0.58   0.563    -.0509887    .0936255
       score |  -.0330876   .0188468    -1.76   0.079    -.0700405    .0038654
       high3 |  -.1710233   .0410637    -4.16   0.000    -.2515368   -.0905097
        low3 |   .1172821   .0524517     2.24   0.025       .01444    .2201243
       _cons |   2.091437   .0330757    63.23   0.000     2.026586    2.156289
------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =     3,226
-------------+----------------------------------   F(4, 3221)      =     16.46
       Model |   76.316091         4  19.0790228   Prob > F        =    0.0000
    Residual |  3733.12098     3,221  1.15899441   R-squared       =    0.0200
-------------+----------------------------------   Adj R-squared   =    0.0188
       Total |  3809.43707     3,225   1.1812208   Root MSE        =    1.0766

------------------------------------------------------------------------------
       rank4 | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      female |  -.1158504   .0380414    -3.05   0.002    -.1904382   -.0412625
       score |   .1431453   .0193333     7.40   0.000     .1052384    .1810522
       high4 |  -.0001986   .0422816    -0.00   0.996    -.0831001    .0827029
        low4 |  -.0645208   .0557283    -1.16   0.247    -.1737872    .0447456
       _cons |   1.958071   .0362707    53.98   0.000     1.886955    2.029187
------------------------------------------------------------------------------

Fitting full model.
Likelihoods for 3226 observations involve cumulative normal distributions above dimension 2.
Using ghk2() to simulate them. Settings:
    Sequence type = hammersley
    Number of draws per observation = 200
    Include antithetic draws = no
    Scramble = no
    Prime bases = 2 3 5
Each observation gets different draws, so changing the order of observations in the data set would change the results.


Iteration 0:   log likelihood = -9340.3545  
Iteration 1:   log likelihood =  -7061.457  (backed up)
Iteration 2:   log likelihood = -6923.8024  (backed up)
Iteration 3:   log likelihood = -6896.5793  (backed up)
Iteration 4:   log likelihood = -6820.6604  (backed up)
Iteration 5:   log likelihood = -6800.5629  (backed up)
Iteration 6:   log likelihood = -6797.7939  (backed up)
Iteration 7:   log likelihood = -6786.3719  (backed up)
Iteration 8:   log likelihood = -6774.7053  (backed up)
Iteration 9:   log likelihood = -6773.0761  (backed up)
Iteration 10:  log likelihood = -6768.4098  (backed up)
Iteration 11:  log likelihood = -6762.5507  
Iteration 12:  log likelihood = -6750.3912  
Iteration 13:  log likelihood = -6702.5032  
Iteration 14:  log likelihood = -6678.3193  
Iteration 15:  log likelihood = -6579.9611  
Iteration 16:  log likelihood = -6509.0584  
Iteration 17:  log likelihood = -6475.5495  
Iteration 18:  log likelihood = -6421.8449  
Iteration 19:  log likelihood = -6233.2697  
Iteration 20:  log likelihood = -6148.9587  
Iteration 21:  log likelihood = -6038.2987  
Iteration 22:  log likelihood = -6026.2971  
Iteration 23:  log likelihood = -6020.1481  
Iteration 24:  log likelihood =  -6018.011  
Iteration 25:  log likelihood = -6016.8532  
Iteration 26:  log likelihood =  -6016.458  
Iteration 27:  log likelihood = -6016.2403  
Iteration 28:  log likelihood = -6016.1868  
Iteration 29:  log likelihood = -6016.1747  
Iteration 30:  log likelihood = -6016.1666  
Iteration 31:  log likelihood = -6016.1646  
Iteration 32:  log likelihood =  -6016.164  
Iteration 33:  log likelihood = -6016.1639  
Iteration 34:  log likelihood = -6016.1639  

Mixed-process regression                                Number of obs =  3,226
                                                        Wald chi2(8)  = 119.14
Log likelihood = -6016.1639                             Prob > chi2   = 0.0000

 ( 1)  [esteem]high1 - [variety]high2 = 0
 ( 2)  [esteem]high1 - [autonomy]high3 = 0
 ( 3)  [esteem]high1 - [security]high4 = 0
 ( 4)  [esteem]low1 - [variety]low2 = 0
 ( 5)  [esteem]low1 - [autonomy]low3 = 0
 ( 6)  [esteem]low1 - [security]low4 = 0
------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
esteem       |
       high1 |   .1801095   .0370241     4.86   0.000     .1075436    .2526753
        low1 |  -.1902523   .0416919    -4.56   0.000     -.271967   -.1085376
-------------+----------------------------------------------------------------
variety      |
      female |  -.0381153   .0717914    -0.53   0.595    -.1788239    .1025933
       score |   .1335552   .0366454     3.64   0.000     .0617315     .205379
       high2 |   .1801095   .0370241     4.86   0.000     .1075436    .2526753
        low2 |  -.1902523   .0416919    -4.56   0.000     -.271967   -.1085376
       _cons |   1.516329   .0556516    27.25   0.000     1.407254    1.625404
-------------+----------------------------------------------------------------
autonomy     |
      female |  -.0235301     .06573    -0.36   0.720    -.1523586    .1052984
       score |   .0919844   .0336669     2.73   0.006     .0259986    .1579703
       high3 |   .1801095   .0370241     4.86   0.000     .1075436    .2526753
        low3 |  -.1902523   .0416919    -4.56   0.000     -.271967   -.1085376
       _cons |   .8444654   .0500023    16.89   0.000     .7464626    .9424682
-------------+----------------------------------------------------------------
security     |
      female |   .1517154   .0834368     1.82   0.069    -.0118177    .3152486
       score |  -.1584246    .042579    -3.72   0.000    -.2418779   -.0749713
       high4 |   .1801095   .0370241     4.86   0.000     .1075436    .2526753
        low4 |  -.1902523   .0416919    -4.56   0.000     -.271967   -.1085376
       _cons |    1.13782   .0634075    17.94   0.000     1.013544    1.262097
-------------+----------------------------------------------------------------
    /lnsig_3 |    .291227   .0326099     8.93   0.000     .2273127    .3551413
    /lnsig_4 |    .589474   .0334966    17.60   0.000     .5238219    .6551262
/atanhrho_23 |   .5321197   .0429489    12.39   0.000     .4479414    .6162981
/atanhrho_24 |   .4225539   .0400504    10.55   0.000     .3440567    .5010512
/atanhrho_34 |   .3756279   .0377639     9.95   0.000      .301612    .4496437
-------------+----------------------------------------------------------------
       sig_3 |   1.338068   .0436343                      1.255222    1.426382
       sig_4 |    1.80304   .0603957                      1.688468    1.925385
      rho_23 |   .4869998   .0327628                      .4202053    .5485453
      rho_24 |   .3990798   .0336717                      .3310942    .4629434
      rho_34 |   .3589045   .0328994                      .2927871    .4216061
------------------------------------------------------------------------------

. predict cmppr1, eq(esteem) pr

. predict cmppr2, eq(variety) pr

. predict cmppr3, eq(autonomy) pr

. predict cmppr4, eq(security) pr

. 
. use class10, clear
(Class of 2010 profile)

. cmp (graduate = program#(c.income roommate c.hsgpa) program income roommate hsgpa) (program = i.campus i.scholar income) (hsgpa = income i.hscomp), vce(robust) ind(4 4 1) qui nolr

Fitting individual models as starting point for full model fit.

Fitting full model.

Mixed-process regression                               Number of obs =   2,500
                                                       Wald chi2(13) = 1523.23
Log pseudolikelihood = -2792.9016                      Prob > chi2   =  0.0000

----------------------------------------------------------------------------------
                 |               Robust
                 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
graduate         |
program#c.income |
              1  |   .0164976   .0221913     0.74   0.457    -.0269967    .0599918
                 |
program#roommate |
          0#yes  |   .0634941   .1097149     0.58   0.563    -.1515432    .2785314
           1#no  |          0  (omitted)
          1#yes  |          0  (omitted)
                 |
 program#c.hsgpa |
              1  |  -.2220764   .2566895    -0.87   0.387    -.7251786    .2810259
                 |
         program |   .9567626     .77689     1.23   0.218    -.5659138    2.479439
          income |   .1760785   .0201834     8.72   0.000     .1365198    .2156372
        roommate |   .2475945   .0756878     3.27   0.001     .0992492    .3959398
           hsgpa |   1.160061   .4590317     2.53   0.011      .260375    2.059746
           _cons |  -4.350179   1.312569    -3.31   0.001    -6.922767    -1.77759
-----------------+----------------------------------------------------------------
program          |
          campus |
            yes  |   .7433153   .0735249    10.11   0.000     .5992091    .8874216
                 |
         scholar |
            yes  |   .8970449   .0585469    15.32   0.000     .7822951    1.011795
          income |  -.0799274   .0088987    -8.98   0.000    -.0973686   -.0624862
           _cons |  -.3810041   .0860131    -4.43   0.000    -.5495866   -.2124216
-----------------+----------------------------------------------------------------
hsgpa            |
          income |   .0478626   .0016461    29.08   0.000     .0446363    .0510889
                 |
          hscomp |
       moderate  |  -.1350116   .0115013   -11.74   0.000    -.1575538   -.1124694
           high  |  -.2269435    .019326   -11.74   0.000    -.2648218   -.1890652
                 |
           _cons |    2.79442   .0128088   218.16   0.000     2.769315    2.819525
-----------------+----------------------------------------------------------------
        /lnsig_3 |  -1.339823   .0142861   -93.79   0.000    -1.367824   -1.311823
    /atanhrho_12 |   .3990812   .1209696     3.30   0.001     .1619852    .6361772
    /atanhrho_13 |   .4238471   .1069872     3.96   0.000     .2141561    .6335381
    /atanhrho_23 |  -.0201774   .0263808    -0.76   0.444    -.0718828     .031528
-----------------+----------------------------------------------------------------
           sig_3 |   .2618919   .0037414                      .2546606    .2693286
          rho_12 |   .3791625   .1035785                      .1605832     .562291
          rho_13 |   .4001664    .089855                      .2109411    .5604836
          rho_23 |  -.0201747   .0263701                     -.0717593    .0315175
----------------------------------------------------------------------------------

. 
. use womenwk, clear

. gen selectvar = wage<.

. cmp (wage = education age) (selectvar = married children education age), ind(selectvar $cmp_probit) nolr qui

Fitting individual models as starting point for full model fit.

Fitting full model.

Mixed-process regression                                Number of obs =  2,000
                                                        Wald chi2(6)  = 904.92
Log likelihood = -5178.3045                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
wage         |
   education |   .9899532   .0532565    18.59   0.000     .8855724    1.094334
         age |   .2131293   .0206031    10.34   0.000      .172748    .2535106
       _cons |   .4857941   1.077038     0.45   0.652    -1.625162     2.59675
-------------+----------------------------------------------------------------
selectvar    |
     married |   .4451714   .0673955     6.61   0.000     .3130787    .5772641
    children |   .4387069   .0277828    15.79   0.000     .3842536    .4931603
   education |   .0557319   .0107349     5.19   0.000     .0346918    .0767719
         age |   .0365098   .0041533     8.79   0.000     .0283694    .0446502
       _cons |  -2.491015   .1893402   -13.16   0.000    -2.862115   -2.119915
-------------+----------------------------------------------------------------
    /lnsig_1 |   1.792558    .027598    64.95   0.000     1.738467    1.846649
/atanhrho_12 |   .8742052   .1014227     8.62   0.000     .6754203     1.07299
-------------+----------------------------------------------------------------
       sig_1 |   6.004795   .1657202                      5.688617    6.338545
      rho_12 |   .7035044   .0512267                      .5885341    .7905851
------------------------------------------------------------------------------

. margins, dydx(*) predict(e eq(wage) condition(0 ., eq(selectvar)))

Average marginal effects                                 Number of obs = 2,000
Model VCE: OIM

Expression: E(wage), predict(e eq(wage) condition(0 ., eq(selectvar)))
dy/dx wrt:  education age married children

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   education |     .87699   .0497459    17.63   0.000     .7794898    .9744903
         age |   .1391275   .0192435     7.23   0.000     .1014109    .1768442
     married |  -.9023196   .1354024    -6.66   0.000    -1.167703   -.6369358
    children |  -.8892166   .0531218   -16.74   0.000    -.9933335   -.7850997
------------------------------------------------------------------------------

. margins, dydx(*) expression(predict(e eq(wage) cond(0 ., eq(selectvar))) * predict(pr eq(selectvar)) )

Average marginal effects                                 Number of obs = 2,000
Model VCE: OIM

Expression: predict(e eq(wage) cond(0 ., eq(selectvar))) * predict(pr eq(selectvar))
dy/dx wrt:  education age married children

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   education |   .9757962   .0780941    12.50   0.000     .8227347    1.128858
         age |    .346573   .0290423    11.93   0.000     .2896511     .403495
     married |   2.478963   .3709605     6.68   0.000     1.751894    3.206032
    children |   2.442965   .1487702    16.42   0.000     2.151381    2.734549
------------------------------------------------------------------------------

. predict xb, eq(selectvar) xb
(option xb assumed; fitted values)

. predict e, eq(selectvar) e(0 .)

. gen cmp_mills = e - xb

. 
. gen wage2 = wage > 20 if wage < .
(657 missing values generated)

. cmp (wage2 = education age) (selectvar = married children education age), ind(selectvar*$cmp_probit $cmp_probit) qui

Fitting individual models as starting point for full model fit.

Fitting constant-only model for LR test of overall model fit.

Fitting full model.

Mixed-process regression                                Number of obs =  2,000
                                                        LR chi2(6)    = 713.57
Log likelihood = -1723.0234                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
wage2        |
   education |   .1752309    .013998    12.52   0.000     .1477954    .2026664
         age |    .030768   .0046414     6.63   0.000     .0216711    .0398649
       _cons |  -3.208124   .2297371   -13.96   0.000    -3.658401   -2.757848
-------------+----------------------------------------------------------------
selectvar    |
     married |   .4605773   .0711472     6.47   0.000     .3211314    .6000233
    children |    .447316   .0287729    15.55   0.000     .3909222    .5037097
   education |   .0566248   .0109164     5.19   0.000     .0352291    .0780205
         age |   .0350909   .0041988     8.36   0.000     .0268614    .0433204
       _cons |  -2.475296   .1916274   -12.92   0.000    -2.850879   -2.099713
-------------+----------------------------------------------------------------
/atanhrho_12 |   .7895507    .153343     5.15   0.000     .4890039    1.090097
-------------+----------------------------------------------------------------
      rho_12 |   .6581544   .0869198                      .4534255    .7969137
------------------------------------------------------------------------------

. margins, dydx(*) predict(pr eq(wage2) condition(0 ., eq(selectvar)))

Average marginal effects                                 Number of obs = 2,000
Model VCE: OIM

Expression: predict(pr eq(wage2) condition(0 ., eq(selectvar)))
dy/dx wrt:  education age married children

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
   education |   .0535012   .0041124    13.01   0.000     .0454409    .0615614
         age |   .0063115   .0015761     4.00   0.000     .0032224    .0094006
     married |  -.0564546   .0086164    -6.55   0.000    -.0733425   -.0395667
    children |  -.0548291   .0029907   -18.33   0.000    -.0606908   -.0489674
------------------------------------------------------------------------------

. 
. gen wage3 = (wage > 10)+(wage > 30) if wage < .
(657 missing values generated)

. cmp (wage3 = education age) (selectvar = married children education age), ind(selectvar*$cmp_oprobit $cmp_probit) nolr qui

Fitting individual models as starting point for full model fit.

Fitting full model.

Mixed-process regression                                Number of obs =  2,000
                                                        Wald chi2(6)  = 526.50
Log likelihood = -1570.966                              Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
wage3        |
   education |   .1599579   .0138796    11.52   0.000     .1327543    .1871615
         age |   .0416353   .0051917     8.02   0.000     .0314597    .0518108
-------------+----------------------------------------------------------------
selectvar    |
     married |   .4270637   .0723395     5.90   0.000      .285281    .5688465
    children |   .4463219   .0285305    15.64   0.000     .3904031    .5022407
   education |   .0582844   .0109205     5.34   0.000     .0368806    .0796882
         age |   .0353776   .0042153     8.39   0.000     .0271158    .0436394
       _cons |   -2.48584   .1920874   -12.94   0.000    -2.862325   -2.109356
-------------+----------------------------------------------------------------
    /cut_1_1 |   1.659946   .2982901     5.56   0.000     1.075308    2.244584
    /cut_1_2 |   5.113563   .2872572    17.80   0.000     4.550549    5.676577
/atanhrho_12 |   .8156348   .2153927     3.79   0.000     .3934729    1.237797
-------------+----------------------------------------------------------------
      rho_12 |    .672687   .1179258                      .3743504     .844826
------------------------------------------------------------------------------

. 
. sysuse auto, clear
(1978 automobile data)

. 
. cmp (price = foreign#) (foreign = mpg), ind($cmp_cont $cmp_cont) nolr

Fitting individual models as starting point for full model fit.
Note: For programming reasons, these initial estimates may deviate from your specification.
      For exact fits of each equation alone, run cmp separately on each.

      Source |       SS           df       MS      Number of obs   =        74
-------------+----------------------------------   F(0, 73)        =      0.00
       Model |           0         0           .   Prob > F        =         .
    Residual |   635065396        73  8699525.97   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |   635065396        73  8699525.97   Root MSE        =    2949.5

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   6165.257   342.8719    17.98   0.000     5481.914      6848.6
------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =        74
-------------+----------------------------------   F(1, 72)        =     13.18
       Model |  2.39252954         1  2.39252954   Prob > F        =    0.0005
    Residual |  13.0669299        72  .181485138   R-squared       =    0.1548
-------------+----------------------------------   Adj R-squared   =    0.1430
       Total |  15.4594595        73  .211773417   Root MSE        =    .42601

------------------------------------------------------------------------------
     foreign | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |   .0312915   .0086182     3.63   0.001     .0141114    .0484716
       _cons |  -.3691266   .1901085    -1.94   0.056    -.7481011    .0098478
------------------------------------------------------------------------------

Fitting full model.

Iteration 0:   log likelihood = -734.11692  (not concave)
Iteration 1:   log likelihood = -731.87443  
Iteration 2:   log likelihood = -726.66187  
Iteration 3:   log likelihood = -724.33412  
Iteration 4:   log likelihood = -724.20587  
Iteration 5:   log likelihood = -724.20415  
Iteration 6:   log likelihood = -724.20414  

Mixed-process regression                                Number of obs =     74
                                                        Wald chi2(1)  =  13.55
Log likelihood = -724.20414                             Prob > chi2   = 0.0002

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
price        |
     foreign |  -7634.484    3015.42    -2.53   0.011     -13544.6    -1724.37
       _cons |   8434.968   1047.688     8.05   0.000     6381.538     10488.4
-------------+----------------------------------------------------------------
foreign      |
         mpg |   .0312915    .008501     3.68   0.000     .0146298    .0479531
       _cons |  -.3691267   .1875224    -1.97   0.049    -.7366639   -.0015895
-------------+----------------------------------------------------------------
    /lnsig_1 |   8.447666   .2443584    34.57   0.000     7.968732      8.9266
    /lnsig_2 |  -.8669902   .0821995   -10.55   0.000    -1.028098   -.7058821
/atanhrho_12 |   1.245597   .2954982     4.22   0.000     .6664311    1.824763
-------------+----------------------------------------------------------------
       sig_1 |   4664.173    1139.73                      2889.192    7529.618
       sig_2 |   .4202144   .0345414                      .3576865    .4936729
      rho_12 |   .8470443   .0834829                      .5826274    .9493112
------------------------------------------------------------------------------

. predict pricehat1
(equation #1 assumed)
(option xb assumed; fitted values)
(using reduced-form results for predictions)

. predict pricehat2, reducedform
(equation #1 assumed)
(option xb assumed; fitted values)
(using reduced-form results for predictions)

. 
. cmp (price = foreign#) (foreign = mpg), ind($cmp_cont $cmp_probit)

Fitting individual models as starting point for full model fit.
Note: For programming reasons, these initial estimates may deviate from your specification.
      For exact fits of each equation alone, run cmp separately on each.

      Source |       SS           df       MS      Number of obs   =        74
-------------+----------------------------------   F(0, 73)        =      0.00
       Model |           0         0           .   Prob > F        =         .
    Residual |   635065396        73  8699525.97   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |   635065396        73  8699525.97   Root MSE        =    2949.5

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   6165.257   342.8719    17.98   0.000     5481.914      6848.6
------------------------------------------------------------------------------

Iteration 0:   log likelihood =  -45.03321  
Iteration 1:   log likelihood = -39.264978  
Iteration 2:   log likelihood = -39.258972  
Iteration 3:   log likelihood = -39.258972  

Probit regression                                       Number of obs =     74
                                                        LR chi2(1)    =  11.55
                                                        Prob > chi2   = 0.0007
Log likelihood = -39.258972                             Pseudo R2     = 0.1282

------------------------------------------------------------------------------
     foreign | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |   .0960601   .0301523     3.19   0.001     .0369627    .1551575
       _cons |  -2.635268   .6841462    -3.85   0.000     -3.97617   -1.294366
------------------------------------------------------------------------------

Fitting constant-only model for LR test of overall model fit.

Fitting full model.

Iteration 0:   log likelihood = -732.86307  (not concave)
Iteration 1:   log likelihood =   -727.472  
Iteration 2:   log likelihood = -726.54755  (not concave)
Iteration 3:   log likelihood = -724.30749  
Iteration 4:   log likelihood = -722.89631  
Iteration 5:   log likelihood = -722.80572  
Iteration 6:   log likelihood = -722.80565  

Mixed-process regression                                Number of obs =     74
                                                        LR chi2(2)    =  35.70
Log likelihood = -722.80565                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
price        |
    foreign# |  -2504.828   1065.679    -2.35   0.019     -4593.52   -416.1348
       _cons |   4700.095   818.9909     5.74   0.000     3094.902    6305.288
-------------+----------------------------------------------------------------
foreign      |
         mpg |   .0953733   .0298506     3.20   0.001     .0368672    .1538794
       _cons |  -2.616128   .6741253    -3.88   0.000    -3.937389   -1.294867
-------------+----------------------------------------------------------------
    /lnsig_1 |   8.348892   .2212822    37.73   0.000     7.915187    8.782597
/atanhrho_12 |   1.167507   .2849801     4.10   0.000     .6089562    1.726058
-------------+----------------------------------------------------------------
       sig_1 |   4225.497   935.0273                      2738.558    6519.789
      rho_12 |   .8234713   .0917337                       .543392    .9385883
------------------------------------------------------------------------------

. 
. replace foreign = . in 1/20
(20 real changes made, 20 to missing)

. cmp (price = foreign#) (foreign = mpg), ind($cmp_cont $cmp_probit) // sample does not shrink

(20 observations dropped from price equation because they are unavailable in the foreign equation, on which the price equation depends)

Fitting individual models as starting point for full model fit.
Note: For programming reasons, these initial estimates may deviate from your specification.
      For exact fits of each equation alone, run cmp separately on each.

      Source |       SS           df       MS      Number of obs   =        54
-------------+----------------------------------   F(0, 53)        =      0.00
       Model |           0         0           .   Prob > F        =         .
    Residual |   372473341        53  7027798.89   R-squared       =    0.0000
-------------+----------------------------------   Adj R-squared   =    0.0000
       Total |   372473341        53  7027798.89   Root MSE        =      2651

------------------------------------------------------------------------------
       price | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |   6093.444   360.7554    16.89   0.000     5369.861    6817.028
------------------------------------------------------------------------------

Iteration 0:   log likelihood = -36.498656  
Iteration 1:   log likelihood = -31.372525  
Iteration 2:   log likelihood = -31.364321  
Iteration 3:   log likelihood =  -31.36432  

Probit regression                                       Number of obs =     54
                                                        LR chi2(1)    =  10.27
                                                        Prob > chi2   = 0.0014
Log likelihood = -31.36432                              Pseudo R2     = 0.1407

------------------------------------------------------------------------------
     foreign | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mpg |    .099871   .0337355     2.96   0.003     .0337506    .1659915
       _cons |  -2.415232   .7566186    -3.19   0.001    -3.898177   -.9322868
------------------------------------------------------------------------------

Fitting constant-only model for LR test of overall model fit.

Fitting full model.

Iteration 0:   log likelihood = -530.42411  (not concave)
Iteration 1:   log likelihood = -526.10108  
Iteration 2:   log likelihood = -523.18842  
Iteration 3:   log likelihood =  -522.6001  
Iteration 4:   log likelihood = -522.55094  
Iteration 5:   log likelihood = -522.54995  
Iteration 6:   log likelihood = -522.54995  

Mixed-process regression                                Number of obs =     54
                                                        LR chi2(2)    =  31.01
Log likelihood = -522.54995                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
price        |
    foreign# |  -1995.122   944.9195    -2.11   0.035     -3847.13    -143.114
       _cons |   5593.396   606.9351     9.22   0.000     4403.825    6782.967
-------------+----------------------------------------------------------------
foreign      |
         mpg |   .1014074   .0331233     3.06   0.002     .0364869    .1663279
       _cons |  -2.447796   .7426052    -3.30   0.001    -3.903275   -.9923161
-------------+----------------------------------------------------------------
    /lnsig_1 |   8.217369   .2305037    35.65   0.000      7.76559    8.669147
/atanhrho_12 |   1.204104     .30004     4.01   0.000     .6160363    1.792172
-------------+----------------------------------------------------------------
       sig_1 |   3704.741   853.9563                      2358.049    5820.535
      rho_12 |   .8349021   .0908937                      .5483622    .9459893
------------------------------------------------------------------------------

. 
. use klein, clear

. cmp (consump = wagepriv# wagegovt) (wagepriv = consump# govt capital1), ind($cmp_cont $cmp_cont) nolr tech(dfp) qui

Fitting individual models as starting point for full model fit.

Fitting full model.

Mixed-process regression                                Number of obs =     22
                                                        Wald chi2(3)  =  37.29
Log likelihood = -98.809614                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
consump      |
    wagepriv |   .7561187   .1478251     5.11   0.000     .4663868    1.045851
    wagegovt |   1.112824   .3425861     3.25   0.001     .4413677     1.78428
       _cons |     20.567   4.117891     4.99   0.000     12.49608    28.63791
-------------+----------------------------------------------------------------
wagepriv     |
     consump |   .4301203   .2037431     2.11   0.035     .0307913    .8294494
        govt |   1.091156    .472698     2.31   0.021     .1646851    2.017627
    capital1 |  -.0294533   .0429395    -0.69   0.493    -.1136132    .0547065
       _cons |   13.83549   11.41972     1.21   0.226    -8.546746    36.21772
-------------+----------------------------------------------------------------
    /lnsig_1 |   .6468688   .2866475     2.26   0.024     .0850499    1.208688
    /lnsig_2 |    .815462   .3958496     2.06   0.039      .039611    1.591313
/atanhrho_12 |   .6576766    .350029     1.88   0.060    -.0283676    1.343721
-------------+----------------------------------------------------------------
       sig_1 |   1.909552   .5473684                      1.088771    3.349086
       sig_2 |    2.26022   .8947071                      1.040406    4.910192
      rho_12 |   .5768151   .2335688                     -.0283599     .872563
------------------------------------------------------------------------------

. 
. use supDem, clear

. cmp (price = quantity# pcompete income) (quantity = price# praw), ind($cmp_cont $cmp_cont) nolr tech(dfp) qui

Fitting individual models as starting point for full model fit.

Fitting full model.

Mixed-process regression                                Number of obs =     49
                                                        Wald chi2(3)  =  43.24
Log likelihood = -194.26517                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
price        |
    quantity |  -.9868107   .3647649    -2.71   0.007    -1.701737   -.2718847
    pcompete |   .2589975   .1282711     2.02   0.043     .0075907    .5104043
      income |   .5208301   .1328699     3.92   0.000     .2604099    .7812503
       _cons |   39.55611    4.33781     9.12   0.000     31.05416    48.05806
-------------+----------------------------------------------------------------
quantity     |
       price |   .5728263   .1767664     3.24   0.001     .2263704    .9192821
        praw |  -.7809401   .1320583    -5.91   0.000     -1.03977   -.5221106
       _cons |  -2.416431    5.32595    -0.45   0.650     -12.8551    8.022239
-------------+----------------------------------------------------------------
    /lnsig_1 |   1.305325   .2308546     5.65   0.000     .8528583    1.757792
    /lnsig_2 |   .5621327   .1112616     5.05   0.000     .3440639    .7802015
/atanhrho_12 |   .8030077   .3091192     2.60   0.009     .1971453     1.40887
-------------+----------------------------------------------------------------
       sig_1 |   3.688888   .8515965                      2.346344    5.799615
       sig_2 |    1.75441   .1951985                      1.410669    2.181912
      rho_12 |   .6657149   .1721249                      .1946303     .887254
------------------------------------------------------------------------------

. cmp, resultsform(reduced)

Mixed-process regression                                Number of obs =     49
                                                        Wald chi2(3)  =  43.24
Log likelihood = -194.26517                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
price        |
    pcompete |    .165465   .0749956     2.21   0.027     .0184763    .3124536
      income |   .3327411   .0628746     5.29   0.000     .2095093     .455973
        praw |   .4923365   .0897074     5.49   0.000     .3165132    .6681598
       _cons |   26.79451   .8094576    33.10   0.000       25.208    28.38102
-------------+----------------------------------------------------------------
quantity     |
    pcompete |   .0947827   .0570316     1.66   0.097    -.0169971    .2065625
      income |   .1906029   .0750693     2.54   0.011     .0434698    .3377359
        praw |  -.4989168   .1113395    -4.48   0.000    -.7171382   -.2806955
       _cons |   12.93217   .9755819    13.26   0.000     11.02006    14.84427
-------------+----------------------------------------------------------------
    /lnsig_1 |   .5980356   .2332472     2.56   0.010     .1408795    1.055192
    /lnsig_2 |   .8139524   .1830302     4.45   0.000     .4552198    1.172685
/atanhrho_12 |   .7917422   .2923816     2.71   0.007     .2186849      1.3648
-------------+----------------------------------------------------------------
       sig_1 |   1.818543   .4241701                      1.151286    2.872526
       sig_2 |    2.25681   .4130644                       1.57652    3.230655
      rho_12 |   .6593949   .1652536                      .2152642    .8775016
------------------------------------------------------------------------------

. margins, dydx(*) predict(eq(quantity))

Average marginal effects                                    Number of obs = 49
Model VCE: OIM

Expression: Linear prediction, predict(eq(quantity))
dy/dx wrt:  pcompete income praw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    pcompete |   .0947827   .0570316     1.66   0.097    -.0169971    .2065625
      income |   .1906029   .0750693     2.54   0.011     .0434698    .3377359
        praw |  -.4989168   .1113395    -4.48   0.000    -.7171382   -.2806955
------------------------------------------------------------------------------

. 
. egen priceO = cut(price), at(25 27 31 33 35 37 39) icodes

. egen quantityO = cut(quantity), at(5 7 9 11 13 15 17 19 21) icodes

. cmp (price: priceO = quantity# pcompete income) (quantity: quantityO = price# praw), ind($cmp_oprobit  $cmp_oprobit) nolr qui tech(dfp)

Fitting individual models as starting point for full model fit.

Fitting full model.

Mixed-process regression                                Number of obs =     49
                                                        Wald chi2(3)  =  12.13
Log likelihood = -118.1489                              Prob > chi2   = 0.0070

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
price        |
   quantity# |  -.4818737   .1069342    -4.51   0.000    -.6914609   -.2722865
    pcompete |   .0288072   .0369498     0.78   0.436    -.0436131    .1012274
      income |   .1300406   .0434306     2.99   0.003     .0449182    .2151629
-------------+----------------------------------------------------------------
quantity     |
      price# |   1.213944    .652785     1.86   0.063    -.0654915    2.493379
        praw |  -.4243131   .1354503    -3.13   0.002    -.6897909   -.1588353
-------------+----------------------------------------------------------------
    /cut_1_1 |   .2424121   .2433322     1.00   0.319    -.2345102    .7193344
    /cut_1_2 |   .8938422   .2908834     3.07   0.002     .3237213    1.463963
    /cut_1_3 |   1.468137   .4053903     3.62   0.000     .6735865    2.262687
    /cut_1_4 |   1.933798   .5120962     3.78   0.000      .930108    2.937488
    /cut_1_5 |   2.467259   .6519785     3.78   0.000     1.189405    3.745114
    /cut_2_1 |  -2.609406   .5926368    -4.40   0.000    -3.770953   -1.447859
    /cut_2_2 |  -1.322325   .5589955    -2.37   0.018    -2.417936    -.226714
    /cut_2_3 |  -.0055342   .6150386    -0.01   0.993    -1.210988    1.199919
    /cut_2_4 |   .6568612   .6611299     0.99   0.320    -.6389296    1.952652
    /cut_2_5 |   2.372419   .8844156     2.68   0.007     .6389959    4.105841
    /cut_2_6 |   2.870168   1.037962     2.77   0.006     .8358006    4.904536
/atanhrho_12 |    1.00039   .4070802     2.46   0.014     .2025279    1.798253
-------------+----------------------------------------------------------------
      rho_12 |   .7617581   .1708616                      .1998036    .9466248
------------------------------------------------------------------------------

. cmp, resultsform(reduced)

Mixed-process regression                                Number of obs =     49
                                                        Wald chi2(3)  =  12.13
Log likelihood = -118.1489                              Prob > chi2   = 0.0070

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
price        |
    pcompete |   .0181752   .0227495     0.80   0.424     -.026413    .0627635
      income |   .0820462   .0288866     2.84   0.005     .0254296    .1386628
        praw |   .1290028   .0212306     6.08   0.000     .0873916     .170614
-------------+----------------------------------------------------------------
quantity     |
    pcompete |   .0220637   .0320406     0.69   0.491    -.0407346    .0848621
      income |   .0995995   .0598281     1.66   0.096    -.0176615    .2168604
        praw |  -.2677109   .0827596    -3.23   0.001    -.4299168   -.1055051
-------------+----------------------------------------------------------------
    /cut_1_1 |   .2424121   .2433322     1.00   0.319    -.2345102    .7193344
    /cut_1_2 |   .8938422   .2908834     3.07   0.002     .3237213    1.463963
    /cut_1_3 |   1.468137   .4053903     3.62   0.000     .6735865    2.262687
    /cut_1_4 |   1.933798   .5120962     3.78   0.000      .930108    2.937488
    /cut_1_5 |   2.467259   .6519785     3.78   0.000     1.189405    3.745114
    /cut_2_1 |  -2.609406   .5926368    -4.40   0.000    -3.770953   -1.447859
    /cut_2_2 |  -1.322325   .5589955    -2.37   0.018    -2.417936    -.226714
    /cut_2_3 |  -.0055342   .6150386    -0.01   0.993    -1.210988    1.199919
    /cut_2_4 |   .6568612   .6611299     0.99   0.320    -.6389296    1.952652
    /cut_2_5 |   2.372419   .8844156     2.68   0.007     .6389959    4.105841
    /cut_2_6 |   2.870168   1.037962     2.77   0.006     .8358006    4.904536
    /lnsig_1 |  -.8090407   .1653206    -4.89   0.000    -1.133063   -.4850183
    /lnsig_2 |   .2714132   .0479868     5.66   0.000     .1773608    .3654656
/atanhrho_12 |    .895957   .2118541     4.23   0.000     .4807305    1.311183
-------------+----------------------------------------------------------------
      rho_12 |   .7143235   .1037538                      .4468285    .8645745
------------------------------------------------------------------------------

. margins, dydx(praw) predict(outcome(3) eq(quantity) pr)

Average marginal effects                                    Number of obs = 49
Model VCE: OIM

Expression: Pr(quantityO=3), predict(outcome(3) eq(quantity) pr)
dy/dx wrt:  praw

------------------------------------------------------------------------------
             |            Delta-method
             |      dy/dx   std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
        praw |   .0107512      .0121     0.89   0.374    -.0129645    .0344668
------------------------------------------------------------------------------

. 
. 
. use union, clear
(NLS Women 14-24 in 1968)

. cmp (union = age grade not_smsa south##c.year || idcode:), ind($cmp_probit) qui

For quadrature, defaulting to technique(bhhh) for speed.

Fitting individual models as starting point for full model fit.

Fitting constants-only model for LR test of overall model fit.

Fitting full model.
Random effects/coefficients modeled with Gauss-Hermite quadrature with 12 integration points.

Mixed-process multilevel regression                     Number of obs = 26,200
                                                        LR chi2(6)    = 225.92
Log likelihood = -10552.225                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
       union | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
union        |
         age |    .008298   .0084646     0.98   0.327    -.0082924    .0248884
       grade |   .0482816   .0099524     4.85   0.000     .0287752     .067788
    not_smsa |  -.1396346   .0460689    -3.03   0.002    -.2299279   -.0493412
     1.south |  -1.584998   .3585285    -4.42   0.000    -2.287701   -.8822953
        year |  -.0039838   .0088446    -0.45   0.652     -.021319    .0133513
             |
south#c.year |
          1  |   .0134079   .0044628     3.00   0.003     .0046609    .0221548
             |
       _cons |  -1.668983   .4754429    -3.51   0.000    -2.600834   -.7371319
-------------+----------------------------------------------------------------
  /lnsig_1_1 |   .3058662   .0230827    13.25   0.000     .2606249    .3511075
------------------------------------------------------------------------------
------------------------------------------------------------------------------------
Random effects parameters           |  Estimate    Std. Err.    [95% Conf. Interval]
------------------------------------+-----------------------------------------------
Level: idcode                       |
    Standard deviations             | 
      _cons                         |  1.357801    .0313417     1.297741     1.42064
------------------------------------+-----------------------------------------------
Level: Observations                 |
 Standard deviation                 |         1  (constrained)
------------------------------------------------------------------------------------

. 
. use nlswork3, clear
(National Longitudinal Survey.  Young Women 14-26 years of age in 1968)

. replace ln_wage = 1.9 if ln_wage > 1.9
(8,345 real changes made)

. cmp (ln_wage = union age grade not_smsa south south#c.year || idcode:), ind("cond(ln_wage<1.899999, $cmp_cont, $cmp_right)") nolr qui

For quadrature, defaulting to technique(bhhh) for speed.

Fitting individual models as starting point for full model fit.

Fitting full model.
Random effects/coefficients modeled with Gauss-Hermite quadrature with 12 integration points.

Mixed-process multilevel regression                    Number of obs =  19,224
                                                       Wald chi2(7)  = 2925.53
Log likelihood = -6814.4603                            Prob > chi2   =  0.0000

------------------------------------------------------------------------------
     ln_wage | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
ln_wage      |
       union |   .1430531   .0069718    20.52   0.000     .1293886    .1567176
         age |   .0099112   .0017517     5.66   0.000      .006478    .0133445
       grade |   .0784872   .0022765    34.48   0.000     .0740253    .0829491
    not_smsa |  -.1339993   .0092061   -14.56   0.000     -.152043   -.1159555
       south |  -.3507543    .069556    -5.04   0.000    -.4870815   -.2144272
             |
south#c.year |
          0  |  -.0008264   .0018371    -0.45   0.653    -.0044271    .0027743
          1  |   .0023678   .0018601     1.27   0.203    -.0012779    .0060135
             |
       _cons |   .5100489   .1006669     5.07   0.000     .3127454    .7073525
-------------+----------------------------------------------------------------
  /lnsig_1_1 |   -1.18873   .0158728   -74.89   0.000     -1.21984   -1.157619
    /lnsig_1 |  -1.390828   .0073349  -189.62   0.000    -1.405204   -1.376452
------------------------------------------------------------------------------
------------------------------------------------------------------------------------
Random effects parameters           |  Estimate    Std. Err.    [95% Conf. Interval]
------------------------------------+-----------------------------------------------
Level: idcode                       |
    Standard deviations             | 
      _cons                         |   .304608     .004835     .2952774    .3142333
------------------------------------+-----------------------------------------------
Level: Observations                 |
 Standard deviation                 |  .2488692    .0018254      .245317    .2524728
------------------------------------------------------------------------------------

. 
. use nlswork5, clear
(National Longitudinal Survey.  Young Women 14-26 years of age in 1968)

. cmp (ln_wage1 ln_wage2 = union age grade south south#c.year occ_code || idcode:), ind($cmp_int) nolr qui

For quadrature, defaulting to technique(bhhh) for speed.

Fitting individual models as starting point for full model fit.

Fitting full model.
Random effects/coefficients modeled with Gauss-Hermite quadrature with 12 integration points.

Mixed-process multilevel regression                    Number of obs =  19,151
                                                       Wald chi2(7)  = 2523.76
Log likelihood = -23174.356                            Prob > chi2   =  0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
ln_wage1     |
       union |   .1441857   .0094253    15.30   0.000     .1257125    .1626588
         age |   .0104112   .0018804     5.54   0.000     .0067256    .0140968
       grade |   .0794937   .0023469    33.87   0.000      .074894    .0840935
       south |  -.3778573   .0979429    -3.86   0.000    -.5698218   -.1858928
             |
south#c.year |
          0  |   .0013501   .0020176     0.67   0.503    -.0026042    .0053045
          1  |   .0047892   .0020833     2.30   0.022      .000706    .0088723
             |
    occ_code |  -.0197911   .0014095   -14.04   0.000    -.0225536   -.0170286
       _cons |   .3792678    .113666     3.34   0.001     .1564865     .602049
-------------+----------------------------------------------------------------
  /lnsig_1_1 |  -1.208288   .0176519   -68.45   0.000    -1.242885    -1.17369
    /lnsig_1 |  -1.041815   .0089171  -116.83   0.000    -1.059292   -1.024338
------------------------------------------------------------------------------
------------------------------------------------------------------------------------
Random effects parameters           |  Estimate    Std. Err.    [95% Conf. Interval]
------------------------------------+-----------------------------------------------
Level: idcode                       |
    Standard deviations             | 
      _cons                         |  .2987084    .0052728     .2885507    .3092237
------------------------------------+-----------------------------------------------
Level: Observations                 |
 Standard deviation                 |  .3528139    .0031461     .3467013    .3590342
------------------------------------------------------------------------------------

. 
. use tvsfpors, clear

. cmp (thk = prethk cc#tv || school: || class:), ind($cmp_oprobit) intpoints(7 7) nolr qui

For quadrature, defaulting to technique(bhhh) for speed.

Fitting individual models as starting point for full model fit.

Fitting full model.
Random effects/coefficients for level 2 modeled with Gauss-Hermite quadrature with 7 integration points.
Random effects/coefficients for level 1 modeled with Gauss-Hermite quadrature with 7 integration points.

Mixed-process multilevel regression                     Number of obs =  1,600
                                                        Wald chi2(4)  = 124.18
Log likelihood = -2116.6982                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
         thk | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
thk          |
      prethk |   .2388382   .0231444    10.32   0.000      .193476    .2842004
             |
       cc#tv |
        0 1  |    .145714   .1255876     1.16   0.246    -.1004331    .3918612
        1 0  |   .5252979   .1285802     4.09   0.000     .2732854    .7773104
        1 1  |   .4284109    .125879     3.40   0.001     .1816927    .6751292
-------------+----------------------------------------------------------------
    /cut_1_1 |  -.0746952   .1029825    -0.73   0.468    -.2765372    .1271468
    /cut_1_2 |   .6862054    .103484     6.63   0.000     .4833805    .8890303
    /cut_1_3 |   1.413571   .1064909    13.27   0.000     1.204853     1.62229
  /lnsig_1_1 |  -1.990742   .4293658    -4.64   0.000    -2.832284   -1.149201
  /lnsig_2_1 |  -1.478722    .215533    -6.86   0.000    -1.901159   -1.056285
------------------------------------------------------------------------------
------------------------------------------------------------------------------------
Random effects parameters           |  Estimate    Std. Err.    [95% Conf. Interval]
------------------------------------+-----------------------------------------------
Level: school                       |
    Standard deviations             | 
      _cons                         |   .136594    .0586488     .0588782    .3168899
------------------------------------+-----------------------------------------------
Level: class                        |
    Standard deviations             | 
      _cons                         |  .2279289    .0491262     .1493954    .3477454
------------------------------------+-----------------------------------------------
Level: Observations                 |
 Standard deviation                 |         1  (constrained)
------------------------------------------------------------------------------------

. 
. use productivity, clear
(Public Capital Productivity)

. cmp (gsp = private emp hwy water other unemp || region: || state:), nolr ind($cmp_cont)

For quadrature, defaulting to technique(bhhh) for speed.

Fitting individual models as starting point for full model fit.
Note: For programming reasons, these initial estimates may deviate from your specification.
      For exact fits of each equation alone, run cmp separately on each.

      Source |       SS           df       MS      Number of obs   =       816
-------------+----------------------------------   F(6, 809)       =  19275.02
       Model |  843.905562         6  140.650927   Prob > F        =    0.0000
    Residual |  5.90331811       809  .007297056   R-squared       =    0.9931
-------------+----------------------------------   Adj R-squared   =    0.9930
       Total |   849.80888       815  1.04271028   Root MSE        =    .08542

------------------------------------------------------------------------------
         gsp | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     private |    .312023   .0110875    28.14   0.000     .2902594    .3337867
         emp |   .5496954   .0155369    35.38   0.000     .5191981    .5801928
         hwy |   .0588818   .0154114     3.82   0.000     .0286307    .0891329
       water |   .1185805   .0123566     9.60   0.000     .0943258    .1428352
       other |   .0085552    .012354     0.69   0.489    -.0156946    .0328049
       unemp |  -.0072705   .0013836    -5.25   0.000    -.0099864   -.0045546
       _cons |   1.926004   .0525032    36.68   0.000     1.822946    2.029063
------------------------------------------------------------------------------

Warning: regressor matrix for gsp equation appears ill-conditioned. (Condition number = 17565.786.)
This might prevent convergence. If it does, and if you have not done so already, you may need to remove nearly
collinear regressors to achieve convergence. Or you may need to add a nrtolerance(#) or nonrtolerance option to the command line.
See cmp tips.

Fitting full model.
Random effects/coefficients for level 2 modeled with Gauss-Hermite quadrature with 12 integration points.
Random effects/coefficients for level 1 modeled with Gauss-Hermite quadrature with 12 integration points.

Iteration 0:   log likelihood =  1092.6464  
Iteration 1:   log likelihood =  1118.9942  
Iteration 2:   log likelihood =  1380.0765  

Performing Naylor-Smith adaptive quadrature.
Iteration 3:   log likelihood =  959.00345  (backed up)
Iteration 4:   log likelihood =  979.72105  
Iteration 5:   log likelihood =  983.51865  
Iteration 6:   log likelihood =  984.18956  
Iteration 7:   log likelihood =  984.34051  
Iteration 8:   log likelihood =  984.40624  
Iteration 9:   log likelihood =  984.43833  
Iteration 10:  log likelihood =  984.45282  
Iteration 11:  log likelihood =   984.4599  
Iteration 12:  log likelihood =  984.46452  
Iteration 13:  log likelihood =  984.46744  
Iteration 14:  log likelihood =  984.46938  
Iteration 15:  log likelihood =  984.47071  
Iteration 16:  log likelihood =  984.47161  

Adaptive quadrature points fixed.
Iteration 17:  log likelihood =  984.47224  
Iteration 18:  log likelihood =  984.47268  
Iteration 19:  log likelihood =  984.47299  
Iteration 20:  log likelihood =   984.4732  
Iteration 21:  log likelihood =  984.47336  
Iteration 22:  log likelihood =  984.47347  
Iteration 23:  log likelihood =  984.47354  
Iteration 24:  log likelihood =   984.4736  
Iteration 25:  log likelihood =  984.47364  
Iteration 26:  log likelihood =  984.47366  
Iteration 27:  log likelihood =  984.47368  
Iteration 28:  log likelihood =   984.4737  
Iteration 29:  log likelihood =  984.47371  

Mixed-process multilevel regression                  Number of obs =       816
                                                     Wald chi2(6)  = 244243.55
Log likelihood = 984.47371                           Prob > chi2   =    0.0000

------------------------------------------------------------------------------
         gsp | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
gsp          |
     private |   .3017608   .0081834    36.87   0.000     .2857216       .3178
         emp |   .7482835   .0113743    65.79   0.000     .7259904    .7705767
         hwy |    .033745   .0089672     3.76   0.000     .0161696    .0513203
       water |   .0890563   .0072782    12.24   0.000     .0747914    .1033213
       other |  -.1199461   .0076254   -15.73   0.000    -.1348917   -.1050005
       unemp |  -.0067224   .0007148    -9.40   0.000    -.0081234   -.0053214
       _cons |   2.224935   .0396898    56.06   0.000     2.147144    2.302726
-------------+----------------------------------------------------------------
  /lnsig_1_1 |  -4.604159   .3513668   -13.10   0.000    -5.292825   -3.915493
  /lnsig_2_1 |  -2.406927   .0303445   -79.32   0.000    -2.466402   -2.347453
    /lnsig_1 |  -3.261838   .0251384  -129.76   0.000    -3.311108   -3.212568
------------------------------------------------------------------------------
------------------------------------------------------------------------------------
Random effects parameters           |  Estimate    Std. Err.    [95% Conf. Interval]
------------------------------------+-----------------------------------------------
Level: region                       |
    Standard deviations             | 
      _cons                         |  .0100101    .0035172     .0050275    .0199307
------------------------------------+-----------------------------------------------
Level: state                        |
    Standard deviations             | 
      _cons                         |  .0900917    .0027338     .0848898    .0956124
------------------------------------+-----------------------------------------------
Level: Observations                 |
 Standard deviation                 |  .0383179    .0009633     .0364757    .0402531
------------------------------------------------------------------------------------

. 
. use womenhlthre, clear
(Women's health status panel)

. gen byte goodhlth = health > 3

. cmp (goodhlth = insured#c.(exercise grade) exercise grade insured || personid:) (insured = grade i.workschool || personid:), ind($cmp_probit $cmp_probit) intp(7) nolr

For quadrature, defaulting to technique(bhhh) for speed.

Fitting individual models as starting point for full model fit.
Note: For programming reasons, these initial estimates may deviate from your specification.
      For exact fits of each equation alone, run cmp separately on each.

Iteration 0:   log likelihood = -4887.8222  
Iteration 1:   log likelihood = -3507.0018  
Iteration 2:   log likelihood = -3492.9672  
Iteration 3:   log likelihood = -3492.9445  
Iteration 4:   log likelihood = -3492.9445  

Probit regression                                      Number of obs =   7,200
                                                       LR chi2(5)    = 2789.76
                                                       Prob > chi2   =  0.0000
Log likelihood = -3492.9445                            Pseudo R2     =  0.2854

------------------------------------------------------------------------------------
          goodhlth | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
insured#c.exercise |
              yes  |  -.0566883    .089773    -0.63   0.528    -.2326402    .1192636
                   |
   insured#c.grade |
              yes  |   .0687099   .0196632     3.49   0.000     .0301708     .107249
                   |
          exercise |   .4943906   .0810009     6.10   0.000     .3356318    .6531494
             grade |   .0014354   .0179925     0.08   0.936    -.0338293       .0367
           insured |     1.0323   .2384196     4.33   0.000     .5650065    1.499594
             _cons |  -1.510664   .2117095    -7.14   0.000    -1.925607   -1.095721
------------------------------------------------------------------------------------

Warning: regressor matrix for goodhlth equation appears ill-conditioned. (Condition number = 282.22136.)
This might prevent convergence. If it does, and if you have not done so already, you may need to remove nearly
collinear regressors to achieve convergence. Or you may need to add a nrtolerance(#) or nonrtolerance option to the command line.
See cmp tips.

Iteration 0:   log likelihood = -4228.0123  
Iteration 1:   log likelihood = -3493.1825  
Iteration 2:   log likelihood = -3477.7418  
Iteration 3:   log likelihood = -3477.6874  
Iteration 4:   log likelihood = -3477.6874  

Probit regression                                      Number of obs =   7,200
                                                       LR chi2(2)    = 1500.65
                                                       Prob > chi2   =  0.0000
Log likelihood = -3477.6874                            Pseudo R2     =  0.1775

------------------------------------------------------------------------------
     insured | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       grade |    .263482      .0079    33.35   0.000     .2479981    .2789658
             |
  workschool |
        yes  |   .5219487   .0594827     8.77   0.000     .4053648    .6385326
       _cons |  -3.130226   .1094756   -28.59   0.000    -3.344794   -2.915658
------------------------------------------------------------------------------

Warning: regressor matrix for insured equation appears ill-conditioned. (Condition number = 39.65625.)
This might prevent convergence. If it does, and if you have not done so already, you may need to remove nearly
collinear regressors to achieve convergence. Or you may need to add a nrtolerance(#) or nonrtolerance option to the command line.
See cmp tips.

Fitting full model.
Random effects/coefficients modeled with Gauss-Hermite quadrature with 7 integration points.

Iteration 0:   log likelihood = -6918.7213  
Iteration 1:   log likelihood = -6850.3289  
Iteration 2:   log likelihood = -6844.8427  
Iteration 3:   log likelihood = -6838.3335  
Iteration 4:   log likelihood = -6837.5503  

Performing Naylor-Smith adaptive quadrature.
Iteration 5:   log likelihood = -6837.2467  
Iteration 6:   log likelihood = -6837.1492  
Iteration 7:   log likelihood = -6837.1046  
Iteration 8:   log likelihood = -6837.0853  
Iteration 9:   log likelihood = -6837.0762  
Iteration 10:  log likelihood = -6837.0719  

Adaptive quadrature points fixed.
Iteration 11:  log likelihood = -6837.0699  
Iteration 12:  log likelihood = -6837.0689  
Iteration 13:  log likelihood = -6837.0685  
Iteration 14:  log likelihood = -6837.0682  
Iteration 15:  log likelihood = -6837.0681  
Iteration 16:  log likelihood = -6837.0681  
Iteration 17:  log likelihood =  -6837.068  
Iteration 18:  log likelihood =  -6837.068  
Iteration 19:  log likelihood =  -6837.068  

Mixed-process multilevel regression                    Number of obs =   7,200
                                                       Wald chi2(7)  = 1245.40
Log likelihood = -6837.068                             Prob > chi2   =  0.0000

------------------------------------------------------------------------------------
                   | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------------+----------------------------------------------------------------
goodhlth           |
insured#c.exercise |
              yes  |  -.0606736   .0949017    -0.64   0.523    -.2466776    .1253304
                   |
   insured#c.grade |
              yes  |   .0260937    .023933     1.09   0.276    -.0208142    .0730016
                   |
          exercise |   .5329759    .088861     6.00   0.000     .3588115    .7071402
             grade |   .1114812   .0320791     3.48   0.001     .0486073    .1743551
           insured |   .8025121   .3179196     2.52   0.012     .1794012    1.425623
             _cons |  -2.321373   .2508949    -9.25   0.000    -2.813118   -1.829628
-------------------+----------------------------------------------------------------
insured            |
             grade |   .2946911   .0101556    29.02   0.000     .2747865    .3145956
                   |
        workschool |
              yes  |   .5780875   .0649145     8.91   0.000     .4508575    .7053176
             _cons |  -3.496674   .1382941   -25.28   0.000    -3.767726   -3.225623
-------------------+----------------------------------------------------------------
        /lnsig_1_1 |    -.53537   .0605838    -8.84   0.000    -.6541122   -.4166278
        /lnsig_1_2 |  -.7089403   .0707772   -10.02   0.000     -.847661   -.5702196
    /atanhrho_1_12 |   .3077889     .10957     2.81   0.005     .0930356    .5225423
      /atanhrho_12 |   .5505493   .1670377     3.30   0.001     .2231614    .8779371
------------------------------------------------------------------------------------
------------------------------------------------------------------------------------
Random effects parameters           |  Estimate    Std. Err.    [95% Conf. Interval]
------------------------------------+-----------------------------------------------
Level: personid                     |
  goodhlth                          |
    Standard deviations             | 
      _cons                         |  .5854526     .035469     .5199034    .6592662
  insured                           |
    Standard deviations             | 
      _cons                         |  .4921655    .0348341     .4284158    .5654013
 Cross-eq correlation               | 
  goodhlth        insured           |
    _cons           _cons           |  .2984243    .0998121     .0927681    .4796597
------------------------------------+-----------------------------------------------
Level: Observations                 |
 Standard deviations                | 
  goodhlth                          |         1  (constrained)
  insured                           |         1  (constrained)
 Cross-eq correlation               | 
  goodhlth        insured           |  .5009318    .1251225     .2195292    .7053844
------------------------------------------------------------------------------------

. 
. use wagework, clear
(Wages for 20 to 77 year olds, 2013-2016)

. cmp (wage = age tenure || personid:) (working = age market || personid:), ind(working*$cmp_cont $cmp_probit) intp(7) nolr

For quadrature, defaulting to technique(bhhh) for speed.

Fitting individual models as starting point for full model fit.
Note: For programming reasons, these initial estimates may deviate from your specification.
      For exact fits of each equation alone, run cmp separately on each.

      Source |       SS           df       MS      Number of obs   =     1,928
-------------+----------------------------------   F(2, 1925)      =   2072.24
       Model |  27990.0611         2  13995.0306   Prob > F        =    0.0000
    Residual |  13000.6329     1,925  6.75357556   R-squared       =    0.6828
-------------+----------------------------------   Adj R-squared   =    0.6825
       Total |  40990.6941     1,927  21.2717665   Root MSE        =    2.5988

------------------------------------------------------------------------------
        wage | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         age |   .1980708   .0049707    39.85   0.000     .1883223    .2078193
      tenure |    .607086   .0160441    37.84   0.000     .5756204    .6385516
       _cons |    13.5062   .2120579    63.69   0.000     13.09031    13.92209
------------------------------------------------------------------------------

Iteration 0:   log likelihood = -1189.7918  
Iteration 1:   log likelihood =  -1109.256  
Iteration 2:   log likelihood = -1108.6542  
Iteration 3:   log likelihood = -1108.6541  

Probit regression                                       Number of obs =  2,400
                                                        LR chi2(2)    = 162.28
                                                        Prob > chi2   = 0.0000
Log likelihood = -1108.6541                             Pseudo R2     = 0.0682

------------------------------------------------------------------------------
     working | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         age |  -.0168818   .0020713    -8.15   0.000    -.0209416   -.0128221
      market |   .1509165   .0155727     9.69   0.000     .1203945    .1814385
       _cons |   1.645812   .0985764    16.70   0.000     1.452605    1.839018
------------------------------------------------------------------------------

Fitting full model.
Random effects/coefficients modeled with Gauss-Hermite quadrature with 7 integration points.

Iteration 0:   log likelihood = -5613.6498  
Iteration 1:   log likelihood =   -5577.07  
Iteration 2:   log likelihood = -5503.2081  
Iteration 3:   log likelihood = -5469.5677  
Iteration 4:   log likelihood = -5466.3561  
Iteration 5:   log likelihood =  -5465.296  

Performing Naylor-Smith adaptive quadrature.
Iteration 6:   log likelihood = -5464.5606  
Iteration 7:   log likelihood = -5464.3505  
Iteration 8:   log likelihood = -5464.2785  
Iteration 9:   log likelihood = -5464.2521  
Iteration 10:  log likelihood = -5464.2427  
Iteration 11:  log likelihood = -5464.2393  

Adaptive quadrature points fixed.
Iteration 12:  log likelihood = -5464.2381  
Iteration 13:  log likelihood = -5464.2376  
Iteration 14:  log likelihood = -5464.2375  
Iteration 15:  log likelihood = -5464.2374  
Iteration 16:  log likelihood = -5464.2374  
Iteration 17:  log likelihood = -5464.2374  

Mixed-process multilevel regression                    Number of obs =   2,400
                                                       Wald chi2(4)  = 2822.66
Log likelihood = -5464.2374                            Prob > chi2   =  0.0000

-------------------------------------------------------------------------------
              | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
wage          |
          age |   .1855042   .0070383    26.36   0.000     .1717093     .199299
       tenure |   .5985935   .0170587    35.09   0.000     .5651591    .6320279
        _cons |   13.64154    .293377    46.50   0.000     13.06653    14.21654
--------------+----------------------------------------------------------------
working       |
          age |  -.0193848   .0034614    -5.60   0.000     -.026169   -.0126006
       market |   .1896713   .0193482     9.80   0.000     .1517495     .227593
        _cons |   2.035502   .1692716    12.03   0.000     1.703735    2.367268
--------------+----------------------------------------------------------------
   /lnsig_1_1 |   .5438349   .0549769     9.89   0.000     .4360822    .6515877
   /lnsig_1_2 |  -.1580133   .0821695    -1.92   0.054    -.3190625    .0030359
/atanhrho_~12 |     .85066   .1236239     6.88   0.000     .6083615    1.092958
     /lnsig_1 |   .7451795    .024358    30.59   0.000     .6974387    .7929203
 /atanhrho_12 |   .3788468   .1745127     2.17   0.030     .0368081    .7208854
-------------------------------------------------------------------------------
------------------------------------------------------------------------------------
Random effects parameters           |  Estimate    Std. Err.    [95% Conf. Interval]
------------------------------------+-----------------------------------------------
Level: personid                     |
  wage                              |
    Standard deviations             | 
      _cons                         |    1.7226    .0947032     1.546636    1.918585
  working                           |
    Standard deviations             | 
      _cons                         |  .8538384    .0701594     .7268301     1.00304
 Cross-eq correlation               | 
  wage            working           |
    _cons           _cons           |  .6914141    .0645251     .5429727    .7979554
------------------------------------+-----------------------------------------------
Level: Observations                 |
 Standard deviations                | 
  wage                              |   2.10682    .0513179     2.008602     2.20984
  working                           |         1  (constrained)
 Cross-eq correlation               | 
  wage            working           |  .3617055    .1516811     .0367915    .6174575
------------------------------------------------------------------------------------

. 
. 
. use laborsup, clear

. 
. gen byte kids2 = kids + int(uniform()*3)

. gen byte kids3 = kids + int(uniform()*3)

. cmp (kids=fem_educ) (kids2=fem_educ) (kids3=fem_educ), ind($cmp_oprobit $cmp_oprobit $cmp_oprobit) nolr qui

Fitting individual models as starting point for full model fit.

Fitting full model.
Likelihoods for 500 observations involve cumulative normal distributions above dimension 2.
Using ghk2() to simulate them. Settings:
    Sequence type = halton
    Number of draws per observation = 45
    Include antithetic draws = no
    Scramble = no
    Prime bases = 2 3
Each observation gets different draws, so changing the order of observations in the data set would change the results.


Mixed-process regression                                Number of obs =    500
                                                        Wald chi2(3)  =   0.63
Log likelihood = -1999.9162                             Prob > chi2   = 0.8892

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
kids         |
    fem_educ |   .0093335   .0175404     0.53   0.595    -.0250451    .0437121
-------------+----------------------------------------------------------------
kids2        |
    fem_educ |   .0101955   .0173396     0.59   0.557    -.0237895    .0441806
-------------+----------------------------------------------------------------
kids3        |
    fem_educ |   .0030993   .0173468     0.18   0.858    -.0308998    .0370984
-------------+----------------------------------------------------------------
    /cut_1_1 |  -.8622616   .2191113    -3.94   0.000    -1.291712   -.4328113
    /cut_1_2 |  -.1898573   .2181676    -0.87   0.384    -.6174579    .2377434
    /cut_1_3 |    .482813   .2186773     2.21   0.027     .0542134    .9114126
    /cut_1_4 |   1.083129   .2212973     4.89   0.000     .6493942    1.516864
    /cut_2_1 |  -1.412116   .2248446    -6.28   0.000    -1.852803   -.9714287
    /cut_2_2 |  -.7625956   .2171511    -3.51   0.000    -1.188204   -.3369873
    /cut_2_3 |  -.1963642   .2161923    -0.91   0.364    -.6200933    .2273648
    /cut_2_4 |   .4184464     .21629     1.93   0.053    -.0054741     .842367
    /cut_2_5 |   1.029296   .2187732     4.70   0.000     .6005085    1.458084
    /cut_2_6 |   1.739081     .22857     7.61   0.000     1.291092     2.18707
    /cut_3_1 |  -1.551956   .2272051    -6.83   0.000     -1.99727   -1.106643
    /cut_3_2 |  -.8727757   .2174812    -4.01   0.000    -1.299031   -.4465203
    /cut_3_3 |  -.2125172   .2158434    -0.98   0.325    -.6355626    .2105281
    /cut_3_4 |   .3646554   .2166539     1.68   0.092    -.0599786    .7892893
    /cut_3_5 |   1.055406   .2198712     4.80   0.000     .6244664    1.486346
    /cut_3_6 |   1.638168   .2272604     7.21   0.000     1.192746     2.08359
/atanhrho_12 |   1.457333    .058479    24.92   0.000     1.342716     1.57195
/atanhrho_13 |   1.453263   .0585955    24.80   0.000     1.338418    1.568108
/atanhrho_23 |   1.005566   .0503228    19.98   0.000     .9069351    1.104197
-------------+----------------------------------------------------------------
      rho_12 |   .8971334   .0114123                      .8723231    .9173354
      rho_13 |   .8963362   .0115188                      .8712917    .9167243
      rho_23 |   .7639218   .0209556                       .719658    .8020014
------------------------------------------------------------------------------

. 
. cmp (other_inc = fem_work) (fem_work = kids), ind($cmp_cont $cmp_probit) qui robust

Fitting individual models as starting point for full model fit.

Fitting full model.

Mixed-process regression                                Number of obs =    500
                                                        Wald chi2(2)  =  18.29
Log pseudolikelihood = -2455.3039                       Prob > chi2   = 0.0001

------------------------------------------------------------------------------
             |               Robust
             | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
other_inc    |
    fem_work |  -12.20545   7.859203    -1.55   0.120     -27.6092    3.198305
       _cons |   55.16802    3.70883    14.87   0.000     47.89885     62.4372
-------------+----------------------------------------------------------------
fem_work     |
        kids |  -.1699736   .0420562    -4.04   0.000    -.2524022    -.087545
       _cons |   .2229471   .0997094     2.24   0.025     .0275201     .418374
-------------+----------------------------------------------------------------
    /lnsig_1 |   2.822152   .0376486    74.96   0.000     2.748362    2.895941
/atanhrho_12 |  -.1004052   .2963175    -0.34   0.735    -.6811769    .4803664
-------------+----------------------------------------------------------------
       sig_1 |   16.81299   .6329861                      15.61702    18.10054
      rho_12 |  -.1000692   .2933502                      -.592284     .446537
------------------------------------------------------------------------------

. 
. gen byte ind2 = cond(fem_work, cond(fem_inc, $cmp_cont, $cmp_left), $cmp_out)

. cmp (other_inc=fem_inc kids) (fem_inc=fem_educ), ind($cmp_cont ind2)

Fitting individual models as starting point for full model fit.
Note: For programming reasons, these initial estimates may deviate from your specification.
      For exact fits of each equation alone, run cmp separately on each.

      Source |       SS           df       MS      Number of obs   =       500
-------------+----------------------------------   F(2, 497)       =     59.17
       Model |  32260.0321         2   16130.016   Prob > F        =    0.0000
    Residual |   135485.51       497   272.60666   R-squared       =    0.1923
-------------+----------------------------------   Adj R-squared   =    0.1891
       Total |  167745.542       499  336.163411   Root MSE        =    16.511

------------------------------------------------------------------------------
   other_inc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
     fem_inc |  -.6416313   .0594465   -10.79   0.000    -.7584288   -.5248339
        kids |   -.493749   .5539133    -0.89   0.373    -1.582049    .5945513
       _cons |   62.21063   1.841159    33.79   0.000     58.59321    65.82804
------------------------------------------------------------------------------

      Source |       SS           df       MS      Number of obs   =       228
-------------+----------------------------------   F(1, 226)       =      0.39
       Model |  71.1140474         1  71.1140474   Prob > F        =    0.5321
    Residual |  41050.6796       226  181.640175   R-squared       =    0.0017
-------------+----------------------------------   Adj R-squared   =   -0.0027
       Total |  41121.7937       227  181.153276   Root MSE        =    13.477

------------------------------------------------------------------------------
     fem_inc | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
    fem_educ |   .2317164   .3703267     0.63   0.532    -.4980184    .9614511
       _cons |   24.82736   4.878722     5.09   0.000     15.21375    34.44096
------------------------------------------------------------------------------

Fitting constant-only model for LR test of overall model fit.

Fitting full model.

Iteration 0:   log likelihood = -3022.8836  
Iteration 1:   log likelihood =  -3019.716  
Iteration 2:   log likelihood = -3019.1972  
Iteration 3:   log likelihood = -3019.1947  
Iteration 4:   log likelihood = -3019.1947  

Mixed-process regression                                Number of obs =    500
                                                        LR chi2(3)    =  90.21
Log likelihood = -3019.1947                             Prob > chi2   = 0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
other_inc    |
     fem_inc |   -.858467   .0822722   -10.43   0.000    -1.019718   -.6972164
        kids |  -.5590929   .5447125    -1.03   0.305     -1.62671     .508524
       _cons |   66.27093   2.105353    31.48   0.000     62.14452    70.39735
-------------+----------------------------------------------------------------
fem_inc      |
    fem_educ |  -.2626235   .3702052    -0.71   0.478    -.9882123    .4629653
       _cons |   31.19966   4.826105     6.46   0.000     21.74067    40.65865
-------------+----------------------------------------------------------------
    /lnsig_1 |   2.814624   .0332073    84.76   0.000     2.749538    2.879709
    /lnsig_2 |   2.599944   .0469554    55.37   0.000     2.507913    2.691975
/atanhrho_12 |   .3526325   .0933986     3.78   0.000     .1695746    .5356903
-------------+----------------------------------------------------------------
       sig_1 |   16.68689   .5541265                      15.63541    17.80908
       sig_2 |   13.46298   .6321591                      12.27928    14.76079
      rho_12 |   .3387081   .0826836                      .1679677    .4897188
------------------------------------------------------------------------------

. 
. use gcse, clear

. cmp (gcse = lrt || school: lrt), ind($cmp_cont) nolr

For quadrature, defaulting to technique(bhhh) for speed.

Fitting individual models as starting point for full model fit.
Note: For programming reasons, these initial estimates may deviate from your specification.
      For exact fits of each equation alone, run cmp separately on each.

      Source |       SS           df       MS      Number of obs   =     4,059
-------------+----------------------------------   F(1, 4057)      =   2185.01
       Model |  141749.015         1  141749.015   Prob > F        =    0.0000
    Residual |  263191.301     4,057  64.8733797   R-squared       =    0.3500
-------------+----------------------------------   Adj R-squared   =    0.3499
       Total |  404940.316     4,058  99.7881508   Root MSE        =    8.0544

------------------------------------------------------------------------------
        gcse | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         lrt |   .5950551   .0127301    46.74   0.000     .5700972    .6200131
       _cons |   -.011948   .1264225    -0.09   0.925    -.2598056    .2359095
------------------------------------------------------------------------------

Fitting full model.
Random effects/coefficients modeled with Gauss-Hermite quadrature with 12 integration points.

Iteration 0:   log likelihood = -14034.455  
Iteration 1:   log likelihood = -14011.663  
Iteration 2:   log likelihood = -14009.278  

Performing Naylor-Smith adaptive quadrature.
Iteration 3:   log likelihood = -14007.144  
Iteration 4:   log likelihood = -14005.666  
Iteration 5:   log likelihood = -14005.226  
Iteration 6:   log likelihood = -14005.015  
Iteration 7:   log likelihood = -14004.884  
Iteration 8:   log likelihood = -14004.788  
Iteration 9:   log likelihood = -14004.736  
Iteration 10:  log likelihood = -14004.693  
Iteration 11:  log likelihood = -14004.669  
Iteration 12:  log likelihood =  -14004.65  
Iteration 13:  log likelihood = -14004.639  

Adaptive quadrature points fixed.
Iteration 14:  log likelihood =  -14004.63  
Iteration 15:  log likelihood = -14004.625  
Iteration 16:  log likelihood = -14004.621  
Iteration 17:  log likelihood = -14004.619  
Iteration 18:  log likelihood = -14004.617  
Iteration 19:  log likelihood = -14004.615  
Iteration 20:  log likelihood = -14004.614  
Iteration 21:  log likelihood = -14004.614  
Iteration 22:  log likelihood = -14004.613  
Iteration 23:  log likelihood = -14004.613  

Mixed-process multilevel regression                     Number of obs =  4,059
                                                        Wald chi2(1)  = 775.01
Log likelihood = -14004.613                             Prob > chi2   = 0.0000

----------------------------------------------------------------------------------
            gcse | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-----------------+----------------------------------------------------------------
gcse             |
             lrt |   .5566694    .019996    27.84   0.000     .5174779     .595861
           _cons |  -.1175327   .3981998    -0.30   0.768      -.89799    .6629246
-----------------+----------------------------------------------------------------
    /lnsig_1_1_1 |  -2.115736   .1574287   -13.44   0.000     -2.42429   -1.807181
      /lnsig_1_1 |   1.100804   .1011981    10.88   0.000     .9024596    1.299149
/atanhrho_1_2_~1 |   .5446794   .1975688     2.76   0.006     .1574517     .931907
        /lnsig_1 |    2.00698   .0112822   177.89   0.000     1.984867    2.029092
----------------------------------------------------------------------------------
------------------------------------------------------------------------------------
Random effects parameters           |  Estimate    Std. Err.    [95% Conf. Interval]
------------------------------------+-----------------------------------------------
Level: school                       |
    Standard deviations             | 
      lrt                           |  .1205445    .0189772     .0885409    .1641161
      _cons                         |  3.006583    .3042605      2.46566    3.666175
    Intra-eq correlation            | 
      lrt          _cons            |  .4965219    .1488613     .1561634    .7314818
------------------------------------+-----------------------------------------------
Level: Observations                 |
 Standard deviation                 |  7.440811    .0839484     7.278081     7.60718
------------------------------------------------------------------------------------

. 
. use jspmix, clear

. cmp (tby = sex, iia || scy3:), ind($cmp_mprobit) nolr

For quadrature, defaulting to technique(bhhh) for speed.

Fitting individual models as starting point for full model fit.
Note: For programming reasons, these initial estimates may deviate from your specification.
      For exact fits of each equation alone, run cmp separately on each.

Iteration 0:   log likelihood = -739.16886  
Iteration 1:   log likelihood = -739.16886  

Probit regression                                       Number of obs =  1,313
                                                        LR chi2(0)    =   0.00
                                                        Prob > chi2   =      .
Log likelihood = -739.16886                             Pseudo R2     = 0.0000

------------------------------------------------------------------------------
  _mp_cmp_y1 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
       _cons |  -.6726933   .0375882   -17.90   0.000    -.7463647   -.5990219
------------------------------------------------------------------------------

Iteration 0:   log likelihood = -909.39801  
Iteration 1:   log likelihood = -909.35643  
Iteration 2:   log likelihood = -909.35643  

Probit regression                                       Number of obs =  1,313
                                                        LR chi2(1)    =   0.08
                                                        Prob > chi2   = 0.7731
Log likelihood = -909.35643                             Pseudo R2     = 0.0000

------------------------------------------------------------------------------
  _mp_cmp_y2 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         sex |  -.0199575   .0692043    -0.29   0.773    -.1555954    .1156805
       _cons |   .0509084   .0486243     1.05   0.295    -.0443935    .1462104
------------------------------------------------------------------------------

Iteration 0:   log likelihood = -712.88069  
Iteration 1:   log likelihood = -700.51801  
Iteration 2:   log likelihood = -700.50211  
Iteration 3:   log likelihood = -700.50211  

Probit regression                                       Number of obs =  1,313
                                                        LR chi2(1)    =  24.76
                                                        Prob > chi2   = 0.0000
Log likelihood = -700.50211                             Pseudo R2     = 0.0174

------------------------------------------------------------------------------
  _mp_cmp_y3 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         sex |   .3824272   .0772356     4.95   0.000     .2310483    .5338061
       _cons |  -.9309495   .0570867   -16.31   0.000    -1.042837   -.8190616
------------------------------------------------------------------------------

Fitting full model.
Random effects/coefficients modeled with Gauss-Hermite quadrature with 12 integration points.

Iteration 0:   log likelihood = -1407.4207  
Iteration 1:   log likelihood = -1354.8329  
Iteration 2:   log likelihood = -1339.5337  
Iteration 3:   log likelihood = -1328.8529  
Iteration 4:   log likelihood = -1305.2827  
Iteration 5:   log likelihood = -1300.1925  
Iteration 6:   log likelihood = -1299.5707  
Iteration 7:   log likelihood = -1299.5123  

Performing Naylor-Smith adaptive quadrature.
Iteration 8:   log likelihood =   -1299.49  
Iteration 9:   log likelihood = -1299.4868  
Iteration 10:  log likelihood = -1299.4864  

Adaptive quadrature points fixed.
Iteration 11:  log likelihood = -1299.4863  
Iteration 12:  log likelihood = -1299.4863  
Iteration 13:  log likelihood = -1299.4863  

Mixed-process multilevel regression                     Number of obs =  1,313
                                                        Wald chi2(2)  =  40.49
Log likelihood = -1299.4863                             Prob > chi2   = 0.0000

 ( 1)  [_outcome_1_1]_cons = 0
-------------------------------------------------------------------------------
          tby | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
--------------+----------------------------------------------------------------
_outcome_1_1  |
        _cons |          0  (omitted)
--------------+----------------------------------------------------------------
_outcome_1_2  |
          sex |   .4075443   .1134639     3.59   0.000     .1851592    .6299295
        _cons |   .4723055   .1107253     4.27   0.000     .2552878    .6893232
--------------+----------------------------------------------------------------
_outcome_1_3  |
          sex |   .8091407   .1271587     6.36   0.000     .5599143    1.058367
        _cons |  -.4203671   .1304478    -3.22   0.001      -.67604   -.1646942
--------------+----------------------------------------------------------------
   /lnsig_1_2 |  -.6124246   .1718702    -3.56   0.000     -.949284   -.2755652
   /lnsig_1_3 |  -.4555851   .1590117    -2.87   0.004    -.7672423   -.1439279
/atanhrho_~23 |   1.478634    .347292     4.26   0.000     .7979537    2.159313
-------------------------------------------------------------------------------
------------------------------------------------------------------------------------
Random effects parameters           |  Estimate    Std. Err.    [95% Conf. Interval]
------------------------------------+-----------------------------------------------
Level: scy3                         |
  _outcome_1_2                      |
    Standard deviations             | 
      _cons                         |   .542035    .0931597      .387018    .7591429
  _outcome_1_3                      |
    Standard deviations             | 
      _cons                         |  .6340769    .1008256     .4642917    .8659502
 Cross-eq correlations              | 
  _outcome_1_2    _outcome_1_3      |
    _cons           _cons           |  .9012117    .0652275     .6628912    .9737138
------------------------------------+-----------------------------------------------
Level: Observations                 |
 Standard deviations                | 
  _outcome_1_1                      |         0  (constrained)
  _outcome_1_2                      |  1.414214  (constrained)
  _outcome_1_3                      |  1.414214  (constrained)
------------------------------------------------------------------------------------

. 
. use union, clear
(NLS Women 14-24 in 1968)

. cmp (union = age not_smsa black# || idcode:) (black = south#c.year), ind($cmp_probit $cmp_probit) nolr

For quadrature, defaulting to technique(bhhh) for speed.

Fitting individual models as starting point for full model fit.
Note: For programming reasons, these initial estimates may deviate from your specification.
      For exact fits of each equation alone, run cmp separately on each.

Iteration 0:   log likelihood =  -13864.23  
Iteration 1:   log likelihood = -13795.751  
Iteration 2:   log likelihood = -13795.698  
Iteration 3:   log likelihood = -13795.698  

Probit regression                                       Number of obs = 26,200
                                                        LR chi2(2)    = 137.06
                                                        Prob > chi2   = 0.0000
Log likelihood = -13795.698                             Pseudo R2     = 0.0049

------------------------------------------------------------------------------
       union | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         age |     .00726   .0013364     5.43   0.000     .0046406    .0098793
    not_smsa |  -.2063254   .0197442   -10.45   0.000    -.2450233   -.1676275
       _cons |  -.9326388    .041944   -22.24   0.000    -1.014848     -.85043
------------------------------------------------------------------------------

Iteration 0:   log likelihood = -15398.375  
Iteration 1:   log likelihood = -14408.353  
Iteration 2:   log likelihood = -14405.674  
Iteration 3:   log likelihood = -14405.674  

Probit regression                                      Number of obs =  26,200
                                                       LR chi2(2)    = 1985.40
                                                       Prob > chi2   =  0.0000
Log likelihood = -14405.674                            Pseudo R2     =  0.0645

------------------------------------------------------------------------------
       black | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
south#c.year |
          0  |  -.0056099   .0014376    -3.90   0.000    -.0084277   -.0027922
          1  |   .0038232   .0014319     2.67   0.008     .0010166    .0066297
             |
       _cons |   -.503647   .1139842    -4.42   0.000     -.727052   -.2802421
------------------------------------------------------------------------------

Fitting full model.
Random effects/coefficients modeled with Gauss-Hermite quadrature with 12 integration points.

Iteration 0:   log likelihood = -26898.743  
Iteration 1:   log likelihood = -25043.134  
Iteration 2:   log likelihood = -24938.769  
Iteration 3:   log likelihood = -24920.611  

Performing Naylor-Smith adaptive quadrature.
Iteration 4:   log likelihood = -24912.398  
Iteration 5:   log likelihood = -24911.293  
Iteration 6:   log likelihood = -24911.137  
Iteration 7:   log likelihood = -24911.091  
Iteration 8:   log likelihood = -24911.074  

Adaptive quadrature points fixed.
Iteration 9:   log likelihood = -24911.066  
Iteration 10:  log likelihood = -24911.062  
Iteration 11:  log likelihood = -24911.061  
Iteration 12:  log likelihood = -24911.061  
Iteration 13:  log likelihood = -24911.061  
Iteration 14:  log likelihood = -24911.061  

Mixed-process multilevel regression                    Number of obs =  26,200
                                                       Wald chi2(4)  = 1953.26
Log likelihood = -24911.061                            Prob > chi2   =  0.0000

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
union        |
      black# |  -.4352072   .0318649   -13.66   0.000    -.4976612   -.3727532
         age |   .0068405   .0016765     4.08   0.000     .0035546    .0101264
    not_smsa |  -.0761788   .0334133    -2.28   0.023    -.1416677     -.01069
       _cons |  -1.446387   .0597271   -24.22   0.000     -1.56345   -1.329324
-------------+----------------------------------------------------------------
black        |
south#c.year |
          0  |  -.0056484   .0014234    -3.97   0.000    -.0084383   -.0028586
          1  |   .0037859   .0014173     2.67   0.008      .001008    .0065637
             |
       _cons |  -.5004955     .11282    -4.44   0.000    -.7216186   -.2793724
-------------+----------------------------------------------------------------
  /lnsig_1_1 |  -.0515051   .0398143    -1.29   0.196    -.1295396    .0265295
/atanhrho_12 |   .9048804   .0502793    18.00   0.000     .8063347    1.003426
------------------------------------------------------------------------------
------------------------------------------------------------------------------------
Random effects parameters           |  Estimate    Std. Err.    [95% Conf. Interval]
------------------------------------+-----------------------------------------------
Level: idcode                       |
  union                             |
    Standard deviations             | 
      _cons                         |  .9497988    .0378156     .8784998    1.026885
------------------------------------+-----------------------------------------------
Level: Observations                 |
 Standard deviations                | 
  union                             |         1  (constrained)
  black                             |         1  (constrained)
 Cross-eq correlation               | 
  union           black             |  .7186659     .024311     .6675633    .7630293
------------------------------------------------------------------------------------

. 
. 
. use laborsup, clear

. 
. gen byte kids2 = kids + int(uniform()*3)

. cmp (kids=fem_educ) (kids2=fem_educ), ind($cmp_oprobit $cmp_oprobit) nolr tech(dfp) qui

Fitting individual models as starting point for full model fit.

Fitting full model.

Mixed-process regression                                Number of obs =    500
                                                        Wald chi2(2)  =   0.83
Log likelihood = -1388.3493                             Prob > chi2   = 0.6597

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
kids         |
    fem_educ |   .0152958   .0176905     0.86   0.387    -.0193769    .0499685
-------------+----------------------------------------------------------------
kids2        |
    fem_educ |   .0106058    .017355     0.61   0.541    -.0234094     .044621
-------------+----------------------------------------------------------------
    /cut_1_1 |  -.7589509   .2219253    -3.42   0.001    -1.193917   -.3239853
    /cut_1_2 |  -.0698771   .2199954    -0.32   0.751    -.5010603    .3613061
    /cut_1_3 |    .531939   .2204805     2.41   0.016     .0998051    .9640729
    /cut_1_4 |    1.08784   .2226227     4.89   0.000     .6515074    1.524172
    /cut_2_1 |    -1.3253   .2245011    -5.90   0.000    -1.765314   -.8852858
    /cut_2_2 |  -.7170045   .2176139    -3.29   0.001     -1.14352   -.2904891
    /cut_2_3 |  -.1744074   .2161632    -0.81   0.420    -.5980795    .2492647
    /cut_2_4 |   .4243466   .2165381     1.96   0.050    -.0000603    .8487536
    /cut_2_5 |   1.044679   .2186461     4.78   0.000     .6161403    1.473217
    /cut_2_6 |   1.669885    .227507     7.34   0.000     1.223979     2.11579
/atanhrho_12 |   1.563227   .0609162    25.66   0.000     1.443833     1.68262
-------------+----------------------------------------------------------------
      rho_12 |   .9159417   .0098106                      .8944668    .9332008
------------------------------------------------------------------------------

. 
. predict xbA
(equation #1 assumed)
(option xb assumed; fitted values)

. 
. predict xbB*
(option xb assumed; fitted values)

. predict xbC xbD
(option xb assumed; fitted values)

. 
. predict sc*, score

. 
. predict lnl, lnl

. 
. predict prA, pr outcome(0)
(equation #1 assumed)

. predict prB, outcome(#1)
(equation #1 assumed)

. 
. predict prC, outcome(4) eq(kids2)

. 
. predict prD*, pr

. 
. predict prE prF, pr

. 
. predict prG, eq(#2) pr

. 
. qui log close
